{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[ENDOFFEN]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[NOOP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[WHITEWINS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[BLACKWINS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[DRAW]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[ELO1000]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "[ELO1100]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "[ELO1200]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "[ELO1300]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "[ELO1400]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "[ELO1500]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "[ELO1600]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "[ELO1700]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "[ELO1800]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "[ELO1900]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "[ELO2000]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "[ELO2100]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "[ELO2200]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "[ELO2300]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "[ELO2400]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "[ELO2500]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "[ELO2600]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "[ELO2700]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "[ELO2800]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "[ELO2900]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 25,
      "content": "[ELO3000]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 26,
      "content": "[ELO3100]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 27,
      "content": "[ELO3200]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 28,
      "content": "[ELO3300]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 29,
      "content": "[ELO3400]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30,
      "content": "[ELO3500]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 31,
      "content": "[ELO3600]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 32,
      "content": "[ELO3700]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 33,
      "content": "[ELO3800]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 34,
      "content": "[ELO3900]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 35,
      "content": "[ELO4000]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[ENDOFFEN]": 0,
      "[NOOP]": 1,
      "[WHITEWINS]": 2,
      "[BLACKWINS]": 3,
      "[DRAW]": 4,
      "[ELO1000]": 5,
      "[ELO1100]": 6,
      "[ELO1200]": 7,
      "[ELO1300]": 8,
      "[ELO1400]": 9,
      "[ELO1500]": 10,
      "[ELO1600]": 11,
      "[ELO1700]": 12,
      "[ELO1800]": 13,
      "[ELO1900]": 14,
      "[ELO2000]": 15,
      "[ELO2100]": 16,
      "[ELO2200]": 17,
      "[ELO2300]": 18,
      "[ELO2400]": 19,
      "[ELO2500]": 20,
      "[ELO2600]": 21,
      "[ELO2700]": 22,
      "[ELO2800]": 23,
      "[ELO2900]": 24,
      "[ELO3000]": 25,
      "[ELO3100]": 26,
      "[ELO3200]": 27,
      "[ELO3300]": 28,
      "[ELO3400]": 29,
      "[ELO3500]": 30,
      "[ELO3600]": 31,
      "[ELO3700]": 32,
      "[ELO3800]": 33,
      "[ELO3900]": 34,
      "[ELO4000]": 35,
      "#": 36,
      "+": 37,
      "-": 38,
      "0": 39,
      "1": 40,
      "2": 41,
      "3": 42,
      "4": 43,
      "5": 44,
      "6": 45,
      "7": 46,
      "8": 47,
      "9": 48,
      "=": 49,
      "B": 50,
      "K": 51,
      "N": 52,
      "O": 53,
      "Q": 54,
      "R": 55,
      "a": 56,
      "b": 57,
      "c": 58,
      "d": 59,
      "e": 60,
      "f": 61,
      "g": 62,
      "h": 63,
      "x": 64,
      "17": 65,
      "xd": 66,
      "xe": 67,
      "18": 68,
      "16": 69,
      "12": 70,
      "xf": 71,
      "Nf": 72,
      "15": 73,
      "10": 74,
      "xc": 75,
      "14": 76,
      "29": 77,
      "13": 78,
      "59": 79,
      "Nc": 80,
      "60": 81,
      "e4": 82,
      "e5": 83,
      "d4": 84,
      "xg": 85,
      "30": 86,
      "58": 87,
      "d5": 88,
      "28": 89,
      "57": 90,
      "19": 91,
      "xb": 92,
      "27": 93,
      "Be": 94,
      "Bg": 95,
      "Kf": 96,
      "d6": 97,
      "d3": 98,
      "xd5": 99,
      "Kg": 100,
      "d7": 101,
      "26": 102,
      "56": 103,
      "c4": 104,
      "24": 105,
      "Re": 106,
      "xd4": 107,
      "Ra": 108,
      "Rf": 109,
      "d2": 110,
      "Nf3": 111,
      "23": 112,
      "Bb": 113,
      "xe5": 114,
      "c5": 115,
      "20": 116,
      "54": 117,
      "Nf6": 118,
      "53": 119,
      "11": 120,
      "180": 121,
      "55": 122,
      "h5": 123,
      "e6": 124,
      "h6": 125,
      "h4": 126,
      "h3": 127,
      "Bf": 128,
      "xa": 129,
      "xe4": 130,
      "Qf": 131,
      "Nc6": 132,
      "Nc3": 133,
      "50": 134,
      "Ng": 135,
      "c6": 136,
      "Nb": 137,
      "c3": 138,
      "Qe": 139,
      "49": 140,
      "Rb": 141,
      "47": 142,
      "48": 143,
      "Bxf": 144,
      "52": 145,
      "Ke": 146,
      "Rc": 147,
      "22": 148,
      "a5": 149,
      "Qb": 150,
      "46": 151,
      "Kh": 152,
      "43": 153,
      "51": 154,
      "Qg": 155,
      "a4": 156,
      "d8": 157,
      "a6": 158,
      "d1": 159,
      "179": 160,
      "39": 161,
      "40": 162,
      "Ne": 163,
      "37": 164,
      "Rg": 165,
      "Kb": 166,
      "38": 167,
      "a3": 168,
      "120": 169,
      "Bxc": 170,
      "300": 171,
      "36": 172,
      "Qc": 173,
      "44": 174,
      "33": 175,
      "178": 176,
      "f4": 177,
      "45": 178,
      "21": 179,
      "177": 180,
      "Qxf": 181,
      "25": 182,
      "b5": 183,
      "41": 184,
      "g6": 185,
      "Rxf": 186,
      "f5": 187,
      "42": 188,
      "35": 189,
      "b4": 190,
      "Nxf": 191,
      "31": 192,
      "Rh": 193,
      "Bd3": 194,
      "Be7": 195,
      "bxc": 196,
      "xe6": 197,
      "g4": 198,
      "Ne5": 199,
      "Nxc": 200,
      "176": 201,
      "34": 202,
      "Bc4": 203,
      "32": 204,
      "175": 205,
      "exd5": 206,
      "Rxd": 207,
      "g5": 208,
      "xg5": 209,
      "Be3": 210,
      "Bg5": 211,
      "Re1": 212,
      "Qxd": 213,
      "f6": 214,
      "Ne4": 215,
      "Rxc": 216,
      "Qxc": 217,
      "g3": 218,
      "e3": 219,
      "xg4": 220,
      "600": 221,
      "119": 222,
      "f3": 223,
      "173": 224,
      "Bg4": 225,
      "121": 226,
      "174": 227,
      "dxc": 228,
      "Nxe5": 229,
      "b6": 230,
      "Nd5": 231,
      "Re8": 232,
      "Be2": 233,
      "181": 234,
      "xh": 235,
      "Bd6": 236,
      "Kc": 237,
      "xe3": 238,
      "b3": 239,
      "xb5": 240,
      "cxd4": 241,
      "exf": 242,
      "dxe5": 243,
      "xg6": 244,
      "Bf4": 245,
      "gxf": 246,
      "171": 247,
      "Rxa": 248,
      "Bxd": 249,
      "172": 250,
      "xb4": 251,
      "Nxd4": 252,
      "169": 253,
      "Nd4": 254,
      "Nxe4": 255,
      "Qe2": 256,
      "Be6": 257,
      "299": 258,
      "170": 259,
      "Bg7": 260,
      "Bc5": 261,
      "Nd7": 262,
      "118": 263,
      "167": 264,
      "xe7": 265,
      "cxd5": 266,
      "Bb5": 267,
      "117": 268,
      "Bd7": 269,
      "Qe7": 270,
      "168": 271,
      "182": 272,
      "90": 273,
      "Bf5": 274,
      "xg3": 275,
      "Qd2": 276,
      "165": 277,
      "Nxd5": 278,
      "298": 279,
      "Kg7": 280,
      "Nxd": 281,
      "Bb7": 282,
      "166": 283,
      "115": 284,
      "Qc7": 285,
      "Ne7": 286,
      "Nd2": 287,
      "297": 288,
      "Qf3": 289,
      "Bb4": 290,
      "163": 291,
      "Kg2": 292,
      "exd4": 293,
      "Rc8": 294,
      "116": 295,
      "e1": 296,
      "Bxf6": 297,
      "89": 298,
      "161": 299,
      "Kf7": 300,
      "Rxb": 301,
      "183": 302,
      "113": 303,
      "Rd8": 304,
      "164": 305,
      "Bd2": 306,
      "Rd1": 307,
      "Qxa": 308,
      "Ke7": 309,
      "159": 310,
      "122": 311,
      "Bc": 312,
      "Bxf3": 313,
      "Kf2": 314,
      "Qd7": 315,
      "xg7": 316,
      "114": 317,
      "dxe4": 318,
      "xe2": 319,
      "157": 320,
      "Rc1": 321,
      "Kxf": 322,
      "162": 323,
      "Ng5": 324,
      "Qxb": 325,
      "111": 326,
      "87": 327,
      "Ne2": 328,
      "160": 329,
      "109": 330,
      "Qf6": 331,
      "155": 332,
      "107": 333,
      "112": 334,
      "Ke2": 335,
      "296": 336,
      "149": 337,
      "295": 338,
      "Qc2": 339,
      "158": 340,
      "Qb6": 341,
      "e8": 342,
      "Nf5": 343,
      "153": 344,
      "88": 345,
      "147": 346,
      "156": 347,
      "110": 348,
      "151": 349,
      "123": 350,
      "105": 351,
      "Rb8": 352,
      "99": 353,
      "150": 354,
      "97": 355,
      "103": 356,
      "108": 357,
      "Kh1": 358,
      "145": 359,
      "154": 360,
      "101": 361,
      "86": 362,
      "106": 363,
      "Qd3": 364,
      "xh6": 365,
      "Kf6": 366,
      "143": 367,
      "Kf3": 368,
      "148": 369,
      "152": 370,
      "95": 371,
      "77": 372,
      "Kh2": 373,
      "141": 374,
      "93": 375,
      "146": 376,
      "Rb1": 377,
      "Kf8": 378,
      "85": 379,
      "Kh8": 380,
      "139": 381,
      "Nc5": 382,
      "Qxd5": 383,
      "104": 384,
      "Ng4": 385,
      "96": 386,
      "293": 387,
      "137": 388,
      "91": 389,
      "100": 390,
      "Nf4": 391,
      "83": 392,
      "Kd7": 393,
      "Bg2": 394,
      "294": 395,
      "102": 396,
      "98": 397,
      "184": 398,
      "80": 399,
      "81": 400,
      "Nc4": 401,
      "xg2": 402,
      "135": 403,
      "144": 404,
      "79": 405,
      "Ke3": 406,
      "133": 407,
      "Bxe5": 408,
      "67": 409,
      "Kg3": 410,
      "140": 411,
      "Bb2": 412,
      "125": 413,
      "142": 414,
      "Bxa": 415,
      "Kf1": 416,
      "61": 417,
      "131": 418,
      "127": 419,
      "Kh7": 420,
      "129": 421,
      "94": 422,
      "xh5": 423,
      "84": 424,
      "Rf8": 425,
      "Qxd4": 426,
      "92": 427,
      "Ke6": 428,
      "75": 429,
      "124": 430,
      "138": 431,
      "Kg6": 432,
      "136": 433,
      "Qb3": 434,
      "Bxc6": 435,
      "69": 436,
      "Rf1": 437,
      "73": 438,
      "63": 439,
      "82": 440,
      "71": 441,
      "65": 442,
      "291": 443,
      "Rxe": 444,
      "70": 445,
      "Qd6": 446,
      "134": 447,
      "Qh5": 448,
      "76": 449,
      "Kd2": 450,
      "130": 451,
      "132": 452,
      "xh4": 453,
      "292": 454,
      "126": 455,
      "xh3": 456,
      "Bxc3": 457,
      "Nbd7": 458,
      "78": 459,
      "128": 460,
      "Qg4": 461,
      "Nbd2": 462,
      "185": 463,
      "66": 464,
      "74": 465,
      "Bb3": 466,
      "Qe3": 467,
      "Bxe4": 468,
      "72": 469,
      "62": 470,
      "Kg8": 471,
      "Qg5": 472,
      "xb3": 473,
      "68": 474,
      "64": 475,
      "fxe5": 476,
      "Rac": 477,
      "289": 478,
      "Kd6": 479,
      "Bxd5": 480,
      "Kd3": 481,
      "Rd7": 482,
      "Rd2": 483,
      "bxc3": 484,
      "290": 485,
      "bxc6": 486,
      "Qg3": 487,
      "Rd": 488,
      "Rg8": 489,
      "Qa5": 490,
      "287": 491,
      "Kg1": 492,
      "Kf4": 493,
      "Qh4": 494,
      "Re2": 495,
      "a2": 496,
      "Ng6": 497,
      "Kf5": 498,
      "Bf6": 499,
      "598": 500,
      "Bxd4": 501,
      "288": 502,
      "Re7": 503,
      "Nb5": 504,
      "Ng3": 505,
      "xb6": 506,
      "Ke4": 507,
      "Qe6": 508,
      "Bg3": 509,
      "a7": 510,
      "Rg1": 511,
      "599": 512,
      "285": 513,
      "xh7": 514,
      "Ke5": 515,
      "Qf4": 516,
      "Qxf3": 517,
      "Rad1": 518,
      "597": 519,
      "Qd5": 520,
      "Nb4": 521,
      "dxc4": 522,
      "286": 523,
      "Qg6": 524,
      "Qd4": 525,
      "283": 526,
      "Qe4": 527,
      "Bd4": 528,
      "xd6": 529,
      "h2": 530,
      "186": 531,
      "Nxa": 532,
      "Kc7": 533,
      "Qe5": 534,
      "h7": 535,
      "Nd6": 536,
      "302": 537,
      "Kg4": 538,
      "Nxf6": 539,
      "Qf5": 540,
      "Qxe5": 541,
      "Bg6": 542,
      "Kg5": 543,
      "Nb6": 544,
      "dxc5": 545,
      "Qd8": 546,
      "Be4": 547,
      "Bd5": 548,
      "281": 549,
      "284": 550,
      "Qxf6": 551,
      "Nxc6": 552,
      "Be5": 553,
      "e7": 554,
      "Nh5": 555,
      "Kc6": 556,
      "Ne3": 557,
      "Bf3": 558,
      "Kd4": 559,
      "Rc7": 560,
      "Kd5": 561,
      "Rf7": 562,
      "Kc2": 563,
      "279": 564,
      "301": 565,
      "Nd3": 566,
      "282": 567,
      "Rc2": 568,
      "Bxc4": 569,
      "187": 570,
      "exf5": 571,
      "Rf2": 572,
      "Rxd8": 573,
      "Bh4": 574,
      "Ne6": 575,
      "Qxe4": 576,
      "Ra8": 577,
      "277": 578,
      "bxa": 579,
      "596": 580,
      "hxg5": 581,
      "595": 582,
      "Rad8": 583,
      "Kxd": 584,
      "axb5": 585,
      "Qa4": 586,
      "Kc3": 587,
      "Rxd1": 588,
      "Qc6": 589,
      "280": 590,
      "fxe4": 591,
      "Bc6": 592,
      "Bxb": 593,
      "275": 594,
      "Ra1": 595,
      "Nh4": 596,
      "Bb6": 597,
      "Nxf3": 598,
      "hxg4": 599,
      "Bxc5": 600,
      "278": 601,
      "273": 602,
      "Bh5": 603,
      "Kb1": 604,
      "Re3": 605,
      "axb4": 606,
      "Qc3": 607,
      "Bh6": 608,
      "Kc5": 609,
      "xh2": 610,
      "Bxf4": 611,
      "303": 612,
      "e2": 613,
      "271": 614,
      "Kc4": 615,
      "Bxf5": 616,
      "276": 617,
      "Qc5": 618,
      "Nxc3": 619,
      "Nb3": 620,
      "exf4": 621,
      "Rd3": 622,
      "269": 623,
      "Ke8": 624,
      "Rfe1": 625,
      "Kb8": 626,
      "Qd1": 627,
      "274": 628,
      "593": 629,
      "gxf6": 630,
      "Rf3": 631,
      "267": 632,
      "Rab": 633,
      "fxe6": 634,
      "gxf3": 635,
      "594": 636,
      "Qc4": 637,
      "Na5": 638,
      "Bxe6": 639,
      "272": 640,
      "265": 641,
      "Qxd3": 642,
      "Qxd6": 643,
      "a8": 644,
      "270": 645,
      "Rd6": 646,
      "263": 647,
      "Kh6": 648,
      "a1": 649,
      "Bc3": 650,
      "Kd8": 651,
      "Bc2": 652,
      "Ba6": 653,
      "Qf7": 654,
      "261": 655,
      "188": 656,
      "Qb4": 657,
      "268": 658,
      "Kh3": 659,
      "Qf2": 660,
      "hxg6": 661,
      "259": 662,
      "Rh8": 663,
      "Bxd6": 664,
      "Re6": 665,
      "266": 666,
      "Qb5": 667,
      "Rxe8": 668,
      "257": 669,
      "591": 670,
      "Kb6": 671,
      "189": 672,
      "Rxe5": 673,
      "Kxc": 674,
      "255": 675,
      "264": 676,
      "Ra7": 677,
      "253": 678,
      "bxc4": 679,
      "Rf6": 680,
      "592": 681,
      "262": 682,
      "Rh1": 683,
      "251": 684,
      "304": 685,
      "260": 686,
      "Rfe8": 687,
      "Rxe1": 688,
      "exf6": 689,
      "249": 690,
      "Qe8": 691,
      "Rb7": 692,
      "Kb3": 693,
      "Qe1": 694,
      "258": 695,
      "247": 696,
      "Bxg5": 697,
      "Ra2": 698,
      "245": 699,
      "256": 700,
      "Na4": 701,
      "243": 702,
      "589": 703,
      "Rb2": 704,
      "239": 705,
      "Qxe7": 706,
      "254": 707,
      "gxf5": 708,
      "bxc5": 709,
      "241": 710,
      "Ke1": 711,
      "Rxf7": 712,
      "Kb7": 713,
      "Rxe4": 714,
      "237": 715,
      "Rac8": 716,
      "Bxd3": 717,
      "252": 718,
      "Re4": 719,
      "Nxc4": 720,
      "Rac1": 721,
      "250": 722,
      "235": 723,
      "590": 724,
      "Kd1": 725,
      "240": 726,
      "Bxe7": 727,
      "Qxb2": 728,
      "233": 729,
      "305": 730,
      "248": 731,
      "Rg3": 732,
      "Kb2": 733,
      "Rd4": 734,
      "246": 735,
      "Re5": 736,
      "231": 737,
      "Qxc3": 738,
      "Rxd5": 739,
      "Kb5": 740,
      "Rd5": 741,
      "Rxd4": 742,
      "229": 743,
      "244": 744,
      "190": 745,
      "587": 746,
      "Qh3": 747,
      "Qc8": 748,
      "242": 749,
      "Rc3": 750,
      "191": 751,
      "227": 752,
      "Qxe6": 753,
      "Kb4": 754,
      "Nh6": 755,
      "238": 756,
      "Rc6": 757,
      "Qxg5": 758,
      "225": 759,
      "Rae1": 760,
      "c8": 761,
      "xd3": 762,
      "223": 763,
      "236": 764,
      "f8": 765,
      "f1": 766,
      "Qh6": 767,
      "xh8": 768,
      "221": 769,
      "fxe3": 770,
      "Qxc6": 771,
      "234": 772,
      "588": 773,
      "219": 774,
      "232": 775,
      "Qxb7": 776,
      "Rf4": 777,
      "Rxf2": 778,
      "217": 779,
      "Nxe6": 780,
      "230": 781,
      "Bxe3": 782,
      "215": 783,
      "Rf5": 784,
      "585": 785,
      "Rxe6": 786,
      "213": 787,
      "228": 788,
      "193": 789,
      "c1": 790,
      "211": 791,
      "226": 792,
      "Qc1": 793,
      "Ba3": 794,
      "209": 795,
      "Rc4": 796,
      "Nxc5": 797,
      "Rb3": 798,
      "Rxb2": 799,
      "224": 800,
      "fxg6": 801,
      "xe8": 802,
      "207": 803,
      "Rb6": 804,
      "Bh3": 805,
      "Ba4": 806,
      "Rg6": 807,
      "222": 808,
      "205": 809,
      "Rg7": 810,
      "Qxc4": 811,
      "586": 812,
      "220": 813,
      "203": 814,
      "195": 815,
      "Rxf8": 816,
      "Qxf4": 817,
      "Qxg4": 818,
      "Ra3": 819,
      "201": 820,
      "Bxg4": 821,
      "Rxf6": 822,
      "192": 823,
      "xe1": 824,
      "583": 825,
      "Qxd7": 826,
      "197": 827,
      "218": 828,
      "199": 829,
      "Nxe3": 830,
      "Qxe2": 831,
      "Qb7": 832,
      "Nc7": 833,
      "Kh4": 834,
      "Rfd1": 835,
      "Rae8": 836,
      "Rc5": 837,
      "Rxb7": 838,
      "216": 839,
      "Qxe3": 840,
      "Bxd7": 841,
      "Kh5": 842,
      "gxf4": 843,
      "214": 844,
      "hxg3": 845,
      "Kc8": 846,
      "Qxc5": 847,
      "Na6": 848,
      "212": 849,
      "210": 850,
      "Rg2": 851,
      "h8": 852,
      "Nge7": 853,
      "Nxf4": 854,
      "Nxf5": 855,
      "Rxf3": 856,
      "Ra6": 857,
      "208": 858,
      "Rfd8": 859,
      "Rxd6": 860,
      "dxc6": 861,
      "584": 862,
      "581": 863,
      "206": 864,
      "194": 865,
      "Qxf7": 866,
      "axb3": 867,
      "Nxd7": 868,
      "Qg7": 869,
      "204": 870,
      "Nxd3": 871,
      "306": 872,
      "200": 873,
      "Rxf1": 874,
      "Na3": 875,
      "Rh7": 876,
      "202": 877,
      "Nd": 878,
      "196": 879,
      "198": 880,
      "Qxf5": 881,
      "Nxd6": 882,
      "Bxf7": 883,
      "Qxd8": 884,
      "Rh3": 885,
      "579": 886,
      "Kxf7": 887,
      "Bxe2": 888,
      "Rxa2": 889,
      "Rxf4": 890,
      "582": 891,
      "cxb5": 892,
      "Nxg5": 893,
      "Bc7": 894,
      "Qb2": 895,
      "Bxb5": 896,
      "Rxf5": 897,
      "Bxh6": 898,
      "Kc1": 899,
      "Bxg7": 900,
      "exd6": 901,
      "Rg4": 902,
      "Rh2": 903,
      "Rxe7": 904,
      "Nc2": 905,
      "577": 906,
      "Rxe3": 907,
      "307": 908,
      "Nh3": 909,
      "Rxa7": 910,
      "Rxd3": 911,
      "580": 912,
      "Rb4": 913,
      "Rxc3": 914,
      "Qxd1": 915,
      "Bf8": 916,
      "Nxg4": 917,
      "Rxc2": 918,
      "cxb4": 919,
      "Qxd2": 920,
      "Rg5": 921,
      "h1": 922,
      "xh1": 923,
      "Qg2": 924,
      "575": 925,
      "Ra4": 926,
      "Nxf7": 927,
      "Rxc8": 928,
      "Rxc1": 929,
      "Kxa": 930,
      "Rb5": 931,
      "Ra5": 932,
      "578": 933,
      "Rxd7": 934,
      "Bxd2": 935,
      "cxd6": 936,
      "Nf7": 937,
      "Kxg7": 938,
      "Nxb": 939,
      "573": 940,
      "Rh6": 941,
      "Rxc7": 942,
      "g1": 943,
      "fxg5": 944,
      "g8": 945,
      "Qxf2": 946,
      "dxc3": 947,
      "576": 948,
      "Ba5": 949,
      "571": 950,
      "Rxc6": 951,
      "Rh4": 952,
      "axb6": 953,
      "fxg3": 954,
      "Nxe7": 955,
      "569": 956,
      "574": 957,
      "Bc8": 958,
      "Bxb4": 959,
      "Rab1": 960,
      "Rh5": 961,
      "fxg4": 962,
      "Rxd2": 963,
      "Qxg7": 964,
      "567": 965,
      "Rxc4": 966,
      "Nge2": 967,
      "572": 968,
      "Qxc2": 969,
      "xg8": 970,
      "cxd3": 971,
      "Bf2": 972,
      "565": 973,
      "Qa3": 974,
      "Rxg7": 975,
      "Rxe2": 976,
      "570": 977,
      "Nxg6": 978,
      "Nxd2": 979,
      "563": 980,
      "Rxc5": 981,
      "Rab8": 982,
      "Bxb2": 983,
      "Qxc7": 984,
      "Qa6": 985,
      "Bxg6": 986,
      "568": 987,
      "561": 988,
      "Qb8": 989,
      "Nf2": 990,
      "Qf8": 991,
      "Qxg6": 992,
      "Qxg2": 993,
      "Bf1": 994,
      "559": 995,
      "308": 996,
      "566": 997,
      "Rxg2": 998,
      "Nxb5": 999,
      "gxh5": 1000,
      "557": 1001,
      "564": 1002,
      "Qxa2": 1003,
      "555": 1004,
      "Bxh3": 1005,
      "Bxf2": 1006,
      "Bc1": 1007,
      "562": 1008,
      "Bxb7": 1009,
      "Qxb5": 1010,
      "553": 1011,
      "603": 1012,
      "Nh2": 1013,
      "309": 1014,
      "Qf1": 1015,
      "551": 1016,
      "560": 1017,
      "dxe6": 1018,
      "Rxa6": 1019,
      "Qb1": 1020,
      "exf3": 1021,
      "549": 1022,
      "558": 1023,
      "Qxb4": 1024,
      "Bf7": 1025,
      "Qxa7": 1026,
      "547": 1027,
      "Nxg3": 1028,
      "556": 1029,
      "gxh6": 1030,
      "545": 1031,
      "Bxg2": 1032,
      "554": 1033,
      "543": 1034,
      "Qxh6": 1035,
      "b1": 1036,
      "Kxf2": 1037,
      "Nxe2": 1038,
      "Bxg3": 1039,
      "552": 1040,
      "541": 1041,
      "Rxh7": 1042,
      "b8": 1043,
      "Qxh5": 1044,
      "539": 1045,
      "Qxg3": 1046,
      "Rxa4": 1047,
      "xg1": 1048,
      "550": 1049,
      "Nf1": 1050,
      "Qxh4": 1051,
      "537": 1052,
      "Nxb4": 1053,
      "548": 1054,
      "Rxa5": 1055,
      "Qh7": 1056,
      "535": 1057,
      "546": 1058,
      "c7": 1059,
      "Rxa3": 1060,
      "533": 1061,
      "Ka6": 1062,
      "Nf8": 1063,
      "Ne8": 1064,
      "544": 1065,
      "Kxg2": 1066,
      "531": 1067,
      "Rxa1": 1068,
      "542": 1069,
      "c2": 1070,
      "540": 1071,
      "529": 1072,
      "Ba2": 1073,
      "Ka3": 1074,
      "Nh7": 1075,
      "Qxh7": 1076,
      "Rxa8": 1077,
      "527": 1078,
      "Ka7": 1079,
      "538": 1080,
      "525": 1081,
      "Bxa6": 1082,
      "Nxf2": 1083,
      "523": 1084,
      "536": 1085,
      "521": 1086,
      "534": 1087,
      "604": 1088,
      "Ka2": 1089,
      "Ka5": 1090,
      "gxh4": 1091,
      "519": 1092,
      "Rxh5": 1093,
      "532": 1094,
      "gxh3": 1095,
      "Rxb5": 1096,
      "Nxb3": 1097,
      "517": 1098,
      "Rxb4": 1099,
      "Nxc7": 1100,
      "310": 1101,
      "530": 1102,
      "Qxh3": 1103,
      "Nxc2": 1104,
      "515": 1105,
      "bxa4": 1106,
      "Ka4": 1107,
      "Rxg5": 1108,
      "528": 1109,
      "Rxh6": 1110,
      "513": 1111,
      "Rxg6": 1112,
      "526": 1113,
      "511": 1114,
      "Rfc8": 1115,
      "Qxb6": 1116,
      "Bxf8": 1117,
      "509": 1118,
      "524": 1119,
      "f7": 1120,
      "Rxb3": 1121,
      "Qh2": 1122,
      "Qxb3": 1123,
      "Rxg4": 1124,
      "507": 1125,
      "522": 1126,
      "311": 1127,
      "Kxd8": 1128,
      "505": 1129,
      "Rxh4": 1130,
      "520": 1131,
      "480": 1132,
      "503": 1133,
      "Ngf6": 1134,
      "518": 1135,
      "Rxh2": 1136,
      "501": 1137,
      "Qxa8": 1138,
      "516": 1139,
      "f2": 1140,
      "499": 1141,
      "Rxb6": 1142,
      "bxa5": 1143,
      "514": 1144,
      "497": 1145,
      "b7": 1146,
      "Rxh3": 1147,
      "b2": 1148,
      "512": 1149,
      "495": 1150,
      "Rhe1": 1151,
      "Bd8": 1152,
      "493": 1153,
      "510": 1154,
      "479": 1155,
      "491": 1156,
      "Be8": 1157,
      "602": 1158,
      "cxb3": 1159,
      "508": 1160,
      "489": 1161,
      "477": 1162,
      "Qa8": 1163,
      "Rxg3": 1164,
      "Qa7": 1165,
      "506": 1166,
      "487": 1167,
      "Qa1": 1168,
      "485": 1169,
      "475": 1170,
      "483": 1171,
      "504": 1172,
      "481": 1173,
      "900": 1174,
      "502": 1175,
      "420": 1176,
      "473": 1177,
      "500": 1178,
      "Bd1": 1179,
      "Ne1": 1180,
      "Rfc1": 1181,
      "Qh8": 1182,
      "Bb1": 1183,
      "Qxe8": 1184,
      "498": 1185,
      "471": 1186,
      "Qxa1": 1187,
      "Bxa3": 1188,
      "496": 1189,
      "469": 1190,
      "Bxc7": 1191,
      "494": 1192,
      "Bxd8": 1193,
      "467": 1194,
      "478": 1195,
      "492": 1196,
      "Bxc2": 1197,
      "g7": 1198,
      "Nxb6": 1199,
      "Qxa6": 1200,
      "490": 1201,
      "601": 1202,
      "465": 1203,
      "Qxe1": 1204,
      "488": 1205,
      "Kxb": 1206,
      "476": 1207,
      "486": 1208,
      "Nb8": 1209,
      "Bxf1": 1210,
      "463": 1211,
      "Rxb1": 1212,
      "484": 1213,
      "Rxb8": 1214,
      "482": 1215,
      "461": 1216,
      "Qxh2": 1217,
      "474": 1218,
      "459": 1219,
      "605": 1220,
      "607": 1221,
      "R1": 1222,
      "cxb6": 1223,
      "312": 1224,
      "Kxf8": 1225,
      "472": 1226,
      "457": 1227,
      "Kxd1": 1228,
      "455": 1229,
      "470": 1230,
      "Bh2": 1231,
      "Ka1": 1232,
      "Qxa5": 1233,
      "453": 1234,
      "Qxf8": 1235,
      "313": 1236,
      "Qxa4": 1237,
      "468": 1238,
      "451": 1239,
      "Ka8": 1240,
      "Nxh5": 1241,
      "Rhe8": 1242,
      "Qg8": 1243,
      "466": 1244,
      "Bxb6": 1245,
      "449": 1246,
      "Nxh4": 1247,
      "Qa2": 1248,
      "447": 1249,
      "464": 1250,
      "Qh1": 1251,
      "Bxh4": 1252,
      "g2": 1253,
      "Bxd1": 1254,
      "445": 1255,
      "421": 1256,
      "R8": 1257,
      "419": 1258,
      "462": 1259,
      "Kxf1": 1260,
      "443": 1261,
      "606": 1262,
      "441": 1263,
      "460": 1264,
      "439": 1265,
      "423": 1266,
      "Bxb3": 1267,
      "458": 1268,
      "Nfd7": 1269,
      "437": 1270,
      "417": 1271,
      "Bxa8": 1272,
      "435": 1273,
      "456": 1274,
      "Be1": 1275,
      "433": 1276,
      "425": 1277,
      "Qxa3": 1278,
      "454": 1279,
      "431": 1280,
      "429": 1281,
      "427": 1282,
      "452": 1283,
      "415": 1284,
      "Kxf6": 1285,
      "450": 1286,
      "Bxa1": 1287,
      "Bxh7": 1288,
      "Ngf3": 1289,
      "448": 1290,
      "413": 1291,
      "bxa3": 1292,
      "446": 1293,
      "Qg1": 1294,
      "exd3": 1295,
      "Nxf8": 1296,
      "444": 1297,
      "411": 1298,
      "Bh7": 1299,
      "442": 1300,
      "422": 1301,
      "Kxd7": 1302,
      "Ba7": 1303,
      "409": 1304,
      "418": 1305,
      "440": 1306,
      "438": 1307,
      "Nxd8": 1308,
      "Bxh5": 1309,
      "407": 1310,
      "Kxe7": 1311,
      "436": 1312,
      "424": 1313,
      "434": 1314,
      "405": 1315,
      "416": 1316,
      "432": 1317,
      "426": 1318,
      "430": 1319,
      "403": 1320,
      "315": 1321,
      "Ng8": 1322,
      "428": 1323,
      "314": 1324,
      "401": 1325,
      "414": 1326,
      "Qxf1": 1327,
      "bxa6": 1328,
      "399": 1329,
      "Kxg5": 1330,
      "412": 1331,
      "Kxf3": 1332,
      "397": 1333,
      "Kxf4": 1334,
      "395": 1335,
      "Nd8": 1336,
      "608": 1337,
      "410": 1338,
      "Rde1": 1339,
      "Nd1": 1340,
      "Nxb7": 1341,
      "Nxd1": 1342,
      "393": 1343,
      "408": 1344,
      "Kxg4": 1345,
      "Rxh8": 1346,
      "391": 1347,
      "Kxf5": 1348,
      "406": 1349,
      "Nb1": 1350,
      "Nxb2": 1351,
      "389": 1352,
      "387": 1353,
      "Raf1": 1354,
      "Bxa7": 1355,
      "404": 1356,
      "Kxh7": 1357,
      "385": 1358,
      "402": 1359,
      "383": 1360,
      "400": 1361,
      "381": 1362,
      "609": 1363,
      "398": 1364,
      "379": 1365,
      "317": 1366,
      "396": 1367,
      "dxe3": 1368,
      "377": 1369,
      "Kxe5": 1370,
      "Nxa8": 1371,
      "Nxf1": 1372,
      "375": 1373,
      "Raf8": 1374,
      "394": 1375,
      "Qxc8": 1376,
      "Kxe2": 1377,
      "373": 1378,
      "392": 1379,
      "Kxe6": 1380,
      "371": 1381,
      "390": 1382,
      "316": 1383,
      "369": 1384,
      "360": 1385,
      "Rhg1": 1386,
      "Nc8": 1387,
      "Nbc6": 1388,
      "Kxd2": 1389,
      "388": 1390,
      "367": 1391,
      "363": 1392,
      "365": 1393,
      "361": 1394,
      "Rxg8": 1395,
      "359": 1396,
      "386": 1397,
      "Kxg6": 1398,
      "384": 1399,
      "Rxh1": 1400,
      "Bxa2": 1401,
      "Ng7": 1402,
      "357": 1403,
      "Bxa4": 1404,
      "Rhg8": 1405,
      "Qxc1": 1406,
      "382": 1407,
      "Nxg7": 1408,
      "319": 1409,
      "355": 1410,
      "380": 1411,
      "Rde8": 1412,
      "378": 1413,
      "353": 1414,
      "376": 1415,
      "351": 1416,
      "Nb7": 1417,
      "Nxh6": 1418,
      "374": 1419,
      "349": 1420,
      "372": 1421,
      "Qxh8": 1422,
      "347": 1423,
      "321": 1424,
      "370": 1425,
      "345": 1426,
      "368": 1427,
      "318": 1428,
      "Bxh2": 1429,
      "366": 1430,
      "Kxe4": 1431,
      "Rhf8": 1432,
      "343": 1433,
      "364": 1434,
      "362": 1435,
      "341": 1436,
      "358": 1437,
      "323": 1438,
      "Kxg3": 1439,
      "339": 1440,
      "337": 1441,
      "610": 1442,
      "356": 1443,
      "325": 1444,
      "335": 1445,
      "333": 1446,
      "327": 1447,
      "Bb8": 1448,
      "331": 1449,
      "Nxa4": 1450,
      "329": 1451,
      "354": 1452,
      "Ng1": 1453,
      "611": 1454,
      "Nxa1": 1455,
      "352": 1456,
      "Kxh5": 1457,
      "320": 1458,
      "Rhf1": 1459,
      "350": 1460,
      "348": 1461,
      "Nc1": 1462,
      "346": 1463,
      "Kxh4": 1464,
      "344": 1465,
      "342": 1466,
      "322": 1467,
      "340": 1468,
      "Nxa5": 1469,
      "Nb2": 1470,
      "Kxe3": 1471,
      "Bxa5": 1472,
      "338": 1473,
      "324": 1474,
      "336": 1475,
      "Ndf3": 1476,
      "326": 1477,
      "334": 1478,
      "Kxd5": 1479,
      "332": 1480,
      "330": 1481,
      "328": 1482,
      "Red1": 1483,
      "Rxg1": 1484,
      "Kxh2": 1485,
      "Nxh3": 1486,
      "Nxa6": 1487,
      "Ng2": 1488,
      "Kxc4": 1489,
      "Kxd4": 1490,
      "Nxc8": 1491,
      "Nxa7": 1492,
      "Kxc5": 1493,
      "Bxc1": 1494,
      "Rhd1": 1495,
      "Nxh8": 1496,
      "Kxd6": 1497,
      "Kxh6": 1498,
      "Nce7": 1499,
      "Nxg2": 1500,
      "Na7": 1501,
      "Nxa2": 1502,
      "Bxc8": 1503,
      "Nxh7": 1504,
      "Rhd8": 1505,
      "Nxe8": 1506,
      "612": 1507,
      "Nxe1": 1508,
      "Nbc3": 1509,
      "Bxh8": 1510,
      "613": 1511,
      "Qxh1": 1512,
      "Kxd3": 1513,
      "Nxa3": 1514,
      "Kxc3": 1515,
      "Kxh3": 1516,
      "Kxb4": 1517,
      "Nxc1": 1518,
      "Kxc6": 1519,
      "Nce2": 1520,
      "Kxb5": 1521,
      "Nfd2": 1522,
      "Rfb8": 1523,
      "Rfb1": 1524,
      "Bxe1": 1525,
      "Raxd": 1526,
      "Ndf6": 1527,
      "cxb": 1528,
      "Nh": 1529,
      "Bxe8": 1530,
      "Rcd1": 1531,
      "Na2": 1532,
      "Rcd8": 1533,
      "1800": 1534,
      "Qxb8": 1535,
      "Kxc7": 1536,
      "Red8": 1537,
      "614": 1538,
      "Rdg1": 1539,
      "615": 1540,
      "Kxb2": 1541,
      "Qxb1": 1542,
      "Kxc2": 1543,
      "Kxb7": 1544,
      "Nxh2": 1545,
      "Bxb8": 1546,
      "Rdf1": 1547,
      "xd7": 1548,
      "Kxa4": 1549,
      "Bxh1": 1550,
      "Rdf8": 1551,
      "Kxe8": 1552,
      "Kxa5": 1553,
      "Bxb1": 1554,
      "Rdg8": 1555,
      "Kxe1": 1556,
      "Kxb3": 1557,
      "616": 1558,
      "Qxg8": 1559,
      "617": 1560,
      "xd2": 1561,
      "Kxb6": 1562,
      "Bg1": 1563,
      "Ba8": 1564,
      "Rbd8": 1565,
      "Rbd1": 1566,
      "Rbc8": 1567,
      "Bg8": 1568,
      "R5": 1569,
      "Nxh1": 1570,
      "R4": 1571,
      "R6": 1572,
      "R3": 1573,
      "exf7": 1574,
      "Rbc1": 1575,
      "R7": 1576,
      "Bxg8": 1577,
      "Kxa3": 1578,
      "618": 1579,
      "N7": 1580,
      "Nce5": 1581,
      "Na": 1582,
      "R2": 1583,
      "Kxa2": 1584,
      "Nce4": 1585,
      "619": 1586,
      "908": 1587,
      "Bh8": 1588,
      "Kxa6": 1589,
      "Ba1": 1590,
      "Qxg1": 1591,
      "Rec1": 1592,
      "fxg7": 1593,
      "Nbd5": 1594,
      "907": 1595,
      "Kxg8": 1596,
      "Kxa7": 1597,
      "620": 1598,
      "cxb2": 1599,
      "621": 1600,
      "N2": 1601,
      "Rce8": 1602,
      "Rce1": 1603,
      "Raxc": 1604,
      "Ncxe5": 1605,
      "Raxd8": 1606,
      "Kxg1": 1607,
      "Rag8": 1608,
      "Nxb8": 1609,
      "Raxd1": 1610,
      "Qd": 1611,
      "Rec8": 1612,
      "909": 1613,
      "xd8": 1614,
      "axb": 1615,
      "Rag1": 1616,
      "Rdd7": 1617,
      "xd1": 1618,
      "N1": 1619,
      "Rbe1": 1620,
      "Nxb1": 1621,
      "N8": 1622,
      "622": 1623,
      "Nfd5": 1624,
      "623": 1625,
      "Rdd2": 1626,
      "Rbe8": 1627,
      "Nge4": 1628,
      "N5": 1629,
      "906": 1630,
      "Ree7": 1631,
      "Rhc8": 1632,
      "cxb7": 1633,
      "Kxh8": 1634,
      "905": 1635,
      "Ngxe5": 1636,
      "Ree2": 1637,
      "Rdc1": 1638,
      "915": 1639,
      "Nge5": 1640,
      "Nbd4": 1641,
      "Kxc8": 1642,
      "Bxg1": 1643,
      "Bh1": 1644,
      "N4": 1645,
      "Nec6": 1646,
      "898": 1647,
      "897": 1648,
      "Ree1": 1649,
      "624": 1650,
      "903": 1651,
      "Nfd4": 1652,
      "625": 1653,
      "899": 1654,
      "916": 1655,
      "Nxg8": 1656,
      "913": 1657,
      "917": 1658,
      "fxg2": 1659,
      "Rdc8": 1660,
      "Nde5": 1661,
      "Neg5": 1662,
      "N6": 1663,
      "hxg7": 1664,
      "Ncxe4": 1665,
      "904": 1666,
      "Rdd1": 1667,
      "914": 1668,
      "exf2": 1669,
      "Kxc1": 1670,
      "dxc7": 1671,
      "901": 1672,
      "895": 1673,
      "911": 1674,
      "Ndxe5": 1675,
      "Nde4": 1676,
      "dxe7": 1677,
      "896": 1678,
      "Rhc1": 1679,
      "902": 1680,
      "Rdd8": 1681,
      "912": 1682,
      "Qa": 1683,
      "gxf7": 1684,
      "Nfxd4": 1685,
      "910": 1686,
      "Kxh1": 1687,
      "626": 1688,
      "Rdh1": 1689,
      "893": 1690,
      "627": 1691,
      "Ndb5": 1692,
      "Nxg1": 1693,
      "Nbxd2": 1694,
      "Rfxf": 1695,
      "Rcc7": 1696,
      "894": 1697,
      "Rcc2": 1698,
      "Qh": 1699,
      "Ree8": 1700,
      "891": 1701,
      "N3": 1702,
      "923": 1703,
      "hxg2": 1704,
      "919": 1705,
      "918": 1706,
      "Ref1": 1707,
      "921": 1708,
      "Neg4": 1709,
      "Rfa8": 1710,
      "Rfa1": 1711,
      "Nbxd7": 1712,
      "892": 1713,
      "1200": 1714,
      "Ngxe4": 1715,
      "889": 1716,
      "925": 1717,
      "629": 1718,
      "628": 1719,
      "Ref8": 1720,
      "922": 1721,
      "N7f6": 1722,
      "gxh7": 1723,
      "924": 1724,
      "920": 1725,
      "887": 1726,
      "dxc2": 1727,
      "890": 1728,
      "Reb1": 1729,
      "885": 1730,
      "Rdh8": 1731,
      "Nec3": 1732,
      "888": 1733,
      "883": 1734,
      "927": 1735,
      "xf6": 1736,
      "886": 1737,
      "926": 1738,
      "Nfe5": 1739,
      "631": 1740,
      "Nh8": 1741,
      "Raxc8": 1742,
      "881": 1743,
      "630": 1744,
      "Rff1": 1745,
      "Nhf6": 1746,
      "Rff7": 1747,
      "Ned4": 1748,
      "Nfxd5": 1749,
      "Ned5": 1750,
      "Rff2": 1751,
      "exd7": 1752,
      "884": 1753,
      "879": 1754,
      "Rfxd1": 1755,
      "929": 1756,
      "Rff8": 1757,
      "Rcc8": 1758,
      "Nfg5": 1759,
      "882": 1760,
      "877": 1761,
      "931": 1762,
      "R1e2": 1763,
      "Raa8": 1764,
      "N2f3": 1765,
      "R1d2": 1766,
      "928": 1767,
      "875": 1768,
      "gxf2": 1769,
      "880": 1770,
      "633": 1771,
      "Raxc1": 1772,
      "Rfxd8": 1773,
      "Ncd7": 1774,
      "Nfe4": 1775,
      "873": 1776,
      "632": 1777,
      "878": 1778,
      "axb2": 1779,
      "Nbxd5": 1780,
      "930": 1781,
      "933": 1782,
      "Nef6": 1783,
      "Rcxc": 1784,
      "1798": 1785,
      "Rgf8": 1786,
      "871": 1787,
      "Nh1": 1788,
      "Rcc1": 1789,
      "Reb8": 1790,
      "Raa1": 1791,
      "Rcf8": 1792,
      "876": 1793,
      "Rgf1": 1794,
      "1797": 1795,
      "N8d7": 1796,
      "869": 1797,
      "932": 1798,
      "Ned7": 1799,
      "R8d7": 1800,
      "867": 1801,
      "874": 1802,
      "Ndxe4": 1803,
      "Rbb8": 1804,
      "Kxb8": 1805,
      "635": 1806,
      "935": 1807,
      "865": 1808,
      "Nef3": 1809,
      "Nhf3": 1810,
      "872": 1811,
      "863": 1812,
      "Na8": 1813,
      "Rhb8": 1814,
      "634": 1815,
      "xf7": 1816,
      "Kxb1": 1817,
      "870": 1818,
      "Ncd5": 1819,
      "934": 1820,
      "Rge1": 1821,
      "861": 1822,
      "gxh2": 1823,
      "Rcf1": 1824,
      "Ncd4": 1825,
      "868": 1826,
      "xf3": 1827,
      "Nde2": 1828,
      "937": 1829,
      "859": 1830,
      "R8e7": 1831,
      "866": 1832,
      "857": 1833,
      "Rbb1": 1834,
      "637": 1835,
      "fxe7": 1836,
      "864": 1837,
      "855": 1838,
      "Ncd2": 1839,
      "853": 1840,
      "axb7": 1841,
      "939": 1842,
      "Rge8": 1843,
      "862": 1844,
      "1795": 1845,
      "936": 1846,
      "Rbb7": 1847,
      "1796": 1848,
      "Red2": 1849,
      "636": 1850,
      "851": 1851,
      "860": 1852,
      "Rhb1": 1853,
      "Ncxd4": 1854,
      "R1f2": 1855,
      "849": 1856,
      "Kxa8": 1857,
      "847": 1858,
      "Rah8": 1859,
      "858": 1860,
      "Rbb2": 1861,
      "840": 1862,
      "dxe2": 1863,
      "856": 1864,
      "Nbxd4": 1865,
      "639": 1866,
      "845": 1867,
      "938": 1868,
      "Rbf1": 1869,
      "843": 1870,
      "941": 1871,
      "Rde2": 1872,
      "854": 1873,
      "Rah1": 1874,
      "852": 1875,
      "Nexd4": 1876,
      "841": 1877,
      "Nfg4": 1878,
      "Ndb4": 1879,
      "638": 1880,
      "839": 1881,
      "R8f7": 1882,
      "850": 1883,
      "Rbf8": 1884,
      "837": 1885,
      "Na1": 1886,
      "Kxa1": 1887,
      "940": 1888,
      "720": 1889,
      "848": 1890,
      "641": 1891,
      "1793": 1892,
      "846": 1893,
      "835": 1894,
      "833": 1895,
      "943": 1896,
      "1794": 1897,
      "844": 1898,
      "831": 1899,
      "640": 1900,
      "bxc2": 1901,
      "829": 1902,
      "842": 1903,
      "1500": 1904,
      "643": 1905,
      "827": 1906,
      "942": 1907,
      "838": 1908,
      "bxa2": 1909,
      "825": 1910,
      "Raxa": 1911,
      "836": 1912,
      "Ned2": 1913,
      "945": 1914,
      "Nexd5": 1915,
      "xf5": 1916,
      "823": 1917,
      "821": 1918,
      "834": 1919,
      "xf2": 1920,
      "Red7": 1921,
      "819": 1922,
      "Rfe2": 1923,
      "Raa7": 1924,
      "832": 1925,
      "1791": 1926,
      "645": 1927,
      "642": 1928,
      "817": 1929,
      "830": 1930,
      "cxd7": 1931,
      "xf4": 1932,
      "815": 1933,
      "944": 1934,
      "660": 1935,
      "Rdb1": 1936,
      "828": 1937,
      "Rfe7": 1938,
      "947": 1939,
      "Rcb8": 1940,
      "813": 1941,
      "1792": 1942,
      "826": 1943,
      "Ngxe2": 1944,
      "811": 1945,
      "647": 1946,
      "809": 1947,
      "Rcb1": 1948,
      "824": 1949,
      "644": 1950,
      "Rde7": 1951,
      "649": 1952,
      "822": 1953,
      "807": 1954,
      "Raa2": 1955,
      "803": 1956,
      "805": 1957,
      "820": 1958,
      "Ree3": 1959,
      "949": 1960,
      "exd2": 1961,
      "946": 1962,
      "818": 1963,
      "1789": 1964,
      "801": 1965,
      "780": 1966,
      "816": 1967,
      "651": 1968,
      "799": 1969,
      "bxc7": 1970,
      "Nfe7": 1971,
      "xc6": 1972,
      "646": 1973,
      "Rdb8": 1974,
      "814": 1975,
      "795": 1976,
      "797": 1977,
      "cxd2": 1978,
      "653": 1979,
      "812": 1980,
      "793": 1981,
      "951": 1982,
      "789": 1983,
      "1790": 1984,
      "810": 1985,
      "948": 1986,
      "791": 1987,
      "655": 1988,
      "648": 1989,
      "657": 1990,
      "Nhf5": 1991,
      "808": 1992,
      "bxa7": 1993,
      "781": 1994,
      "N6d7": 1995,
      "783": 1996,
      "787": 1997,
      "785": 1998,
      "804": 1999,
      "806": 2000,
      "779": 2001,
      "Nhf4": 2002,
      "777": 2003,
      "659": 2004,
      "802": 2005,
      "1787": 2006,
      "N1d2": 2007,
      "650": 2008,
      "xc3": 2009,
      "775": 2010,
      "800": 2011,
      "950": 2012,
      "773": 2013,
      "953": 2014,
      "798": 2015,
      "Ncb5": 2016,
      "N7b6": 2017,
      "Ngxe7": 2018,
      "661": 2019,
      "796": 2020,
      "652": 2021,
      "771": 2022,
      "Nde7": 2023,
      "794": 2024,
      "769": 2025,
      "792": 2026,
      "1788": 2027,
      "767": 2028,
      "654": 2029,
      "R8c7": 2030,
      "765": 2031,
      "656": 2032,
      "xc4": 2033,
      "Raxb": 2034,
      "788": 2035,
      "719": 2036,
      "Rdd3": 2037,
      "790": 2038,
      "1785": 2039,
      "717": 2040,
      "658": 2041,
      "663": 2042,
      "763": 2043,
      "Nfxe4": 2044,
      "786": 2045,
      "782": 2046,
      "784": 2047,
      "778": 2048,
      "1799": 2049,
      "721": 2050,
      "Rgd1": 2051,
      "759": 2052,
      "952": 2053,
      "955": 2054,
      "761": 2055,
      "776": 2056,
      "715": 2057,
      "Rgd8": 2058,
      "665": 2059,
      "755": 2060,
      "757": 2061,
      "753": 2062,
      "713": 2063,
      "667": 2064,
      "774": 2065,
      "723": 2066,
      "751": 2067,
      "Nfxe5": 2068,
      "749": 2069,
      "747": 2070,
      "669": 2071,
      "772": 2072,
      "745": 2073,
      "711": 2074,
      "743": 2075,
      "1783": 2076,
      "Nef5": 2077,
      "725": 2078,
      "1786": 2079,
      "957": 2080,
      "727": 2081,
      "770": 2082,
      "739": 2083,
      "Rfg8": 2084,
      "737": 2085,
      "741": 2086,
      "671": 2087,
      "729": 2088,
      "768": 2089,
      "731": 2090,
      "735": 2091,
      "662": 2092,
      "Ndc5": 2093,
      "709": 2094,
      "718": 2095,
      "Ncb4": 2096,
      "954": 2097,
      "707": 2098,
      "766": 2099,
      "733": 2100,
      "675": 2101,
      "673": 2102,
      "764": 2103,
      "705": 2104,
      "Ref2": 2105,
      "R1c2": 2106,
      "677": 2107,
      "703": 2108,
      "762": 2109,
      "679": 2110,
      "960": 2111,
      "N8e7": 2112,
      "699": 2113,
      "722": 2114,
      "664": 2115,
      "697": 2116,
      "701": 2117,
      "685": 2118,
      "Rcd2": 2119,
      "681": 2120,
      "716": 2121,
      "689": 2122,
      "687": 2123,
      "683": 2124,
      "760": 2125,
      "750": 2126,
      "695": 2127,
      "691": 2128,
      "1781": 2129,
      "758": 2130,
      "Ndc4": 2131,
      "693": 2132,
      "959": 2133,
      "756": 2134,
      "956": 2135,
      "1784": 2136,
      "714": 2137,
      "754": 2138,
      "666": 2139,
      "fxe2": 2140,
      "748": 2141,
      "Rhg7": 2142,
      "Rfg1": 2143,
      "668": 2144,
      "Nac6": 2145,
      "752": 2146,
      "724": 2147,
      "Ree6": 2148,
      "712": 2149,
      "746": 2150,
      "Rcd7": 2151,
      "710": 2152,
      "744": 2153,
      "742": 2154,
      "728": 2155,
      "730": 2156,
      "xf8": 2157,
      "726": 2158,
      "670": 2159,
      "Rfxf7": 2160,
      "740": 2161,
      "738": 2162,
      "Rdd6": 2163,
      "736": 2164,
      "672": 2165,
      "734": 2166,
      "708": 2167,
      "732": 2168,
      "Nef4": 2169,
      "706": 2170,
      "Rea1": 2171,
      "1779": 2172,
      "xc5": 2173,
      "674": 2174,
      "958": 2175,
      "676": 2176,
      "680": 2177,
      "1782": 2178,
      "704": 2179,
      "678": 2180,
      "Rfd2": 2181,
      "682": 2182,
      "700": 2183,
      "702": 2184,
      "961": 2185,
      "696": 2186,
      "694": 2187,
      "698": 2188,
      "690": 2189,
      "684": 2190,
      "Rhh8": 2191,
      "686": 2192,
      "688": 2193,
      "692": 2194,
      "Rff3": 2195,
      "1777": 2196,
      "Rhh1": 2197,
      "Ref7": 2198,
      "Rhg2": 2199,
      "Rbxb": 2200,
      "1780": 2201,
      "Rgg7": 2202,
      "xc8": 2203,
      "963": 2204,
      "1775": 2205,
      "Rgg2": 2206,
      "N5f6": 2207,
      "1778": 2208,
      "965": 2209,
      "1773": 2210,
      "xf1": 2211,
      "Reg1": 2212,
      "962": 2213,
      "Rfd7": 2214,
      "1771": 2215,
      "Reg8": 2216,
      "Rfxf2": 2217,
      "1776": 2218,
      "N1c3": 2219,
      "Nac4": 2220,
      "967": 2221,
      "Rdc7": 2222,
      "1774": 2223,
      "1769": 2224,
      "964": 2225,
      "Ncxd5": 2226,
      "Rdc2": 2227,
      "Rgf7": 2228,
      "Ndc6": 2229,
      "1767": 2230,
      "xc1": 2231,
      "Rdf2": 2232,
      "969": 2233,
      "1772": 2234,
      "Rgg8": 2235,
      "Rfe3": 2236,
      "Rgg1": 2237,
      "1765": 2238,
      "Red3": 2239,
      "Nac5": 2240,
      "Nfe2": 2241,
      "Ndf5": 2242,
      "966": 2243,
      "R1e3": 2244,
      "Rgf2": 2245,
      "1770": 2246,
      "N4f3": 2247,
      "1763": 2248,
      "971": 2249,
      "N2b3": 2250,
      "exf8": 2251,
      "Rcg8": 2252,
      "Ndf4": 2253,
      "968": 2254,
      "Rab7": 2255,
      "Rff6": 2256,
      "1761": 2257,
      "Rdf7": 2258,
      "N1e2": 2259,
      "1768": 2260,
      "Rec2": 2261,
      "Nac3": 2262,
      "1759": 2263,
      "Rea8": 2264,
      "973": 2265,
      "Rce2": 2266,
      "1766": 2267,
      "970": 2268,
      "Rab2": 2269,
      "Rbc7": 2270,
      "1757": 2271,
      "1764": 2272,
      "975": 2273,
      "1755": 2274,
      "1197": 2275,
      "1762": 2276,
      "1753": 2277,
      "Rde3": 2278,
      "972": 2279,
      "1198": 2280,
      "Rec7": 2281,
      "Rgf3": 2282,
      "R1d3": 2283,
      "N7c6": 2284,
