{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[ENDOFFEN]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[ENDOFFEN]": 0,
      "-": 1,
      "/": 2,
      "0": 3,
      "1": 4,
      "2": 5,
      "3": 6,
      "4": 7,
      "5": 8,
      "6": 9,
      "7": 10,
      "8": 11,
      "9": 12,
      "B": 13,
      "K": 14,
      "N": 15,
      "P": 16,
      "Q": 17,
      "R": 18,
      "a": 19,
      "b": 20,
      "c": 21,
      "d": 22,
      "e": 23,
      "f": 24,
      "g": 25,
      "h": 26,
      "k": 27,
      "n": 28,
      "p": 29,
      "q": 30,
      "r": 31,
      "w": 32,
      "PP": 33,
      "pp": 34,
      "p1": 35,
      "P1": 36,
      "P2": 37,
      "p2": 38,
      "K1": 39,
      "k1": 40,
      "P3": 41,
      "p3": 42,
      "B1": 43,
      "PPP": 44,
      "r1": 45,
      "b1": 46,
      "R1": 47,
      "ppp": 48,
      "kq": 49,
      "N2": 50,
      "KQ": 51,
      "PP1": 52,
      "P4": 53,
      "pp1": 54,
      "N1": 55,
      "n1": 56,
      "p4": 57,
      "n2": 58,
      "R2": 59,
      "r2": 60,
      "RK1": 61,
      "rk1": 62,
      "Q1": 63,
      "q1": 64,
      "KQkq": 65,
      "qk": 66,
      "QK": 67,
      "R3": 68,
      "2p": 69,
      "nr": 70,
      "r3": 71,
      "2P": 72,
      "RN": 73,
      "2R": 74,
      "rn": 75,
      "B2": 76,
      "2r": 77,
      "r1b": 78,
      "p1p": 79,
      "BQK": 80,
      "PP3": 81,
      "P1P": 82,
      "NR": 83,
      "R4": 84,
      "rnb": 85,
      "pppp": 86,
      "4P3": 87,
      "bnr": 88,
      "PPP2": 89,
      "r4": 90,
      "2N": 91,
      "3P4": 92,
      "1p": 93,
      "b1r": 94,
      "1P": 95,
      "b2": 96,
      "bp": 97,
      "4p3": 98,
      "3p": 99,
      "pp2": 100,
      "3p4": 101,
      "B1R": 102,
      "PP2": 103,
      "Q2": 104,
      "q1rk1": 105,
      "2n": 106,
      "qkbnr": 107,
      "Q1RK1": 108,
      "RNBQK": 109,
      "p1p1": 110,
      "R1K1": 111,
      "pp3": 112,
      "q2": 113,
      "BNR": 114,
      "B3": 115,
      "ppp2": 116,
      "PPP2PPP": 117,
      "3P1": 118,
      "1p2": 119,
      "1p1": 120,
      "BP": 121,
      "2K": 122,
      "1P1": 123,
      "3p1": 124,
      "3P": 125,
      "2k": 126,
      "N1P": 127,
      "2P1": 128,
      "2p1": 129,
      "2p5": 130,
      "ppp1": 131,
      "n1p": 132,
      "r1k1": 133,
      "2P5": 134,
      "2P2": 135,
      "PPPP": 136,
      "K2R": 137,
      "qkb1r": 138,
      "qk2r": 139,
      "p2p": 140,
      "rnbqkbnr": 141,
      "R4RK1": 142,
      "N3": 143,
      "1P2": 144,
      "b3": 145,
      "4p": 146,
      "k2r": 147,
      "2p2": 148,
      "PPP1": 149,
      "PPPP1": 150,
      "PP4": 151,
      "1P3": 152,
      "6p1": 153,
      "n3": 154,
      "PP3PPP": 155,
      "k2": 156,
      "ppp2ppp": 157,
      "r4rk1": 158,
      "K2": 159,
      "6P1": 160,
      "R1B": 161,
      "4P": 162,
      "6K1": 163,
      "1p3": 164,
      "PPPP1PPP": 165,
      "np1": 166,
      "P1P1": 167,
      "R1BQK": 168,
      "5N2": 169,
      "2B": 170,
      "bppp": 171,
      "7P": 172,
      "Q3": 173,
      "5P2": 174,
      "q3": 175,
      "6k1": 176,
      "RNBQKBNR": 177,
      "10": 178,
      "P5": 179,
      "2N2": 180,
      "11": 181,
      "1B": 182,
      "12": 183,
      "13": 184,
      "14": 185,
      "7p": 186,
      "15": 187,
      "16": 188,
      "17": 189,
      "p5": 190,
      "18": 191,
      "5p2": 192,
      "1b": 193,
      "p2p1": 194,
      "19": 195,
      "R2QK": 196,
      "1p6": 197,
      "pppp1": 198,
      "20": 199,
      "1P6": 200,
      "k1nr": 201,
      "2B1": 202,
      "21": 203,
      "rn1": 204,
      "5p": 205,
      "5P": 206,
      "P2P": 207,
      "2N5": 208,
      "r1b1": 209,
      "B4": 210,
      "22": 211,
      "R2Q1RK1": 212,
      "r2q1rk1": 213,
      "pp3ppp": 214,
      "23": 215,
      "P7": 216,
      "pp4": 217,
      "24": 218,
      "p7": 219,
      "RN1": 220,
      "2b": 221,
      "K1NR": 222,
      "k3": 223,
      "R5": 224,
      "25": 225,
      "pppp1ppp": 226,
      "K3": 227,
      "26": 228,
      "PPP3": 229,
      "NP1": 230,
      "pb": 231,
      "R1B1": 232,
      "2n5": 233,
      "Q4": 234,
      "27": 235,
      "p3p": 236,
      "q4": 237,
      "R2K1": 238,
      "r5": 239,
      "BPPP": 240,
      "P1P2": 241,
      "28": 242,
      "3n": 243,
      "3N": 244,
      "R3R": 245,
      "kb1r": 246,
      "R1K": 247,
      "2n2": 248,
      "RNB": 249,
      "3P2": 250,
      "kp": 251,
      "P3P": 252,
      "29": 253,
      "1P4": 254,
      "r1bq1rk1": 255,
      "5n2": 256,
      "5rk1": 257,
      "B2RK1": 258,
      "b4": 259,
      "2n1": 260,
      "2p3": 261,
      "1p4": 262,
      "5RK1": 263,
      "2P3": 264,
      "2N1": 265,
      "30": 266,
      "PB": 267,
      "R3K2R": 268,
      "r2k1": 269,
      "RNBQKB1R": 270,
      "RNB1": 271,
      "r1b2": 272,
      "r1k": 273,
      "1pp": 274,
      "2b1": 275,
      "QR1K1": 276,
      "31": 277,
      "1q": 278,
      "3R1": 279,
      "2B1P3": 280,
      "qk1nr": 281,
      "6P": 282,
      "2N2N2": 283,
      "p1p2": 284,
      "R1BQ1RK1": 285,
      "4R": 286,
      "6p": 287,
      "ppbp": 288,
      "r3r": 289,
      "3pP3": 290,
      "32": 291,
      "4r": 292,
      "pbp": 293,
      "1Q": 294,
      "1PP": 295,
      "P1N": 296,
      "KB1R": 297,
      "p1n": 298,
      "r3k2r": 299,
      "r6": 300,
      "3r1": 301,
      "KP": 302,
      "R5K1": 303,
      "P4P": 304,
      "R6": 305,
      "RNBQK2R": 306,
      "33": 307,
      "PPP3PP": 308,
      "1b1": 309,
      "R2QK2R": 310,
      "pP": 311,
      "2r2": 312,
      "ppp3": 313,
      "4p1": 314,
      "pppppppp": 315,
      "rnbqkb1r": 316,
      "r1bqkbnr": 317,
      "R3R1K1": 318,
      "2q": 319,
      "RN1QK": 320,
      "1K": 321,
      "r1bqk2r": 322,
      "1PP2": 323,
      "rnb1": 324,
      "34": 325,
      "r1b2rk1": 326,
      "R1BQK2R": 327,
      "ppp1pppp": 328,
      "1k": 329,
      "4P1": 330,
      "kbnr": 331,
      "4R1K1": 332,
      "r2qk2r": 333,
      "2KR3R": 334,
      "3p2": 335,
      "bpp1": 336,
      "QK1NR": 337,
      "2R2": 338,
      "R1B2RK1": 339,
      "35": 340,
      "1B1": 341,
      "r7": 342,
      "2Q": 343,
      "3R": 344,
      "r1bqkb1r": 345,
      "pb1": 346,
      "1n": 347,
      "Q1P": 348,
      "1N": 349,
      "PP4PP": 350,
      "r5k1": 351,
      "R7": 352,
      "qr1k1": 353,
      "p4p": 354,
      "36": 355,
      "k4": 356,
      "5PP1": 357,
      "2PP4": 358,
      "2p1p3": 359,
      "P2P1": 360,
      "K4": 361,
      "1pp1": 362,
      "2B5": 363,
      "5K2": 364,
      "3PP3": 365,
      "Pp": 366,
      "N1PPP": 367,
      "1pp2": 368,
      "rn2": 369,
      "R1BQKB1R": 370,
      "5pp1": 371,
      "RN2": 372,
      "5k2": 373,
      "PBP": 374,
      "2P1P3": 375,
      "37": 376,
      "R3K1": 377,
      "r3k1": 378,
      "3R4": 379,
      "B1N2": 380,
      "P4PPP": 381,
      "4r1k1": 382,
      "pp1p": 383,
      "3r4": 384,
      "3R2K1": 385,
      "PP3PP1": 386,
      "QPPP": 387,
      "4R3": 388,
      "n1ppp": 389,
      "3r": 390,
      "2kr3r": 391,
      "5PPP": 392,
      "1K1": 393,
      "3b": 394,
      "5r2": 395,
      "38": 396,
      "4N3": 397,
      "BPP1": 398,
      "5ppp": 399,
      "3Pp3": 400,
      "PPP2PP1": 401,
      "6PP": 402,
      "7r": 403,
      "1PP1": 404,
      "4r3": 405,
      "3B": 406,
      "2n2n2": 407,
      "2pp": 408,
      "P1N2": 409,
      "PB1": 410,
      "r2qkb1r": 411,
      "5R2": 412,
      "q1p": 413,
      "7R": 414,
      "1r3": 415,
      "N4": 416,
      "1R3": 417,
      "RNBQ1RK1": 418,
      "2P2N2": 419,
      "1p2p3": 420,
      "5p1p": 421,
      "R2QKB1R": 422,
      "n4": 423,
      "39": 424,
      "r3r1k1": 425,
      "2b5": 426,
      "pp2pppp": 427,
      "3B4": 428,
      "PPP1PPPP": 429,
      "4p1p1": 430,
      "BN2": 431,
      "3P1B2": 432,
      "P1P3": 433,
      "3p2p1": 434,
      "rnbqk2r": 435,
      "4n3": 436,
      "6pp": 437,
      "3r2k1": 438,
      "2p1p": 439,
      "7K": 440,
      "pp1p1": 441,
      "p1n1": 442,
      "2r5": 443,
      "qp": 444,
      "R1BQKBNR": 445,
      "B1P": 446,
      "2K5": 447,
      "40": 448,
      "p4ppp": 449,
      "5P1P": 450,
      "qppp": 451,
      "3R1RK1": 452,
      "p3p3": 453,
      "ppp3pp": 454,
      "2r1": 455,
      "5B2": 456,
      "r1b1k2r": 457,
      "1k1": 458,
      "BP2": 459,
      "b1p1": 460,
      "b1p": 461,
      "QP": 462,
      "3P1P2": 463,
      "1r1": 464,
      "2k5": 465,
      "1R1": 466,
      "p1p3": 467,
      "PK": 468,
      "B2P": 469,
      "2R5": 470,
      "1P4P1": 471,
      "rnbq1rk1": 472,
      "4pn2": 473,
      "b1pp": 474,
      "3n4": 475,
      "2p3p1": 476,
      "7k": 477,
      "p1n2": 478,
      "41": 479,
      "R1B1K2R": 480,
      "2PP1": 481,
      "nppp": 482,
      "1r": 483,
      "3b1": 484,
      "P6P": 485,
      "3q4": 486,
      "3N4": 487,
      "5b2": 488,
      "5Q2": 489,
      "1b2": 490,
      "kp1": 491,
      "1p4p1": 492,
      "2pP4": 493,
      "3Q": 494,
      "2R1": 495,
      "P2p": 496,
      "2b1p3": 497,
      "p6p": 498,
      "6B1": 499,
      "4B3": 500,
      "B1PP": 501,
      "p5p1": 502,
      "R2QR1K1": 503,
      "PPBP": 504,
      "2r2rk1": 505,
      "pp4pp": 506,
      "2P4P": 507,
      "2pp4": 508,
      "r3kb1r": 509,
      "4k3": 510,
      "np": 511,
      "2pp1": 512,
      "2P3P1": 513,
      "P5P1": 514,
      "Pp2": 515,
      "4b": 516,
      "3Q4": 517,
      "42": 518,
      "KBNR": 519,
      "3r1rk1": 520,
      "2n1p3": 521,
      "4K3": 522,
      "4p2p": 523,
      "1r6": 524,
      "Pp1": 525,
      "B1P1": 526,
      "6R1": 527,
      "3q": 528,
      "2R3K1": 529,
      "2r3k1": 530,
      "1B2": 531,
      "ppp2pp1": 532,
      "6r1": 533,
      "1R6": 534,
      "PP6": 535,
      "3B1": 536,
      "1B3": 537,
      "pp3pp1": 538,
      "3b4": 539,
      "pP3": 540,
      "bp1": 541,
      "1p1p1": 542,
      "1P3PPP": 543,
      "k1p": 544,
      "43": 545,
      "P1N1": 546,
      "1R4": 547,
      "1R": 548,
      "Pp3": 549,
      "BP1": 550,
      "2R2RK1": 551,
      "RNB1K2R": 552,
      "2p2n2": 553,
      "NP": 554,
      "1P2P3": 555,
      "KP1": 556,
      "pp1n": 557,
      "1P1P4": 558,
      "4b3": 559,
      "1r4": 560,
      "qp1": 561,
      "pk": 562,
      "1p1p": 563,
      "3P3P": 564,
      "4k": 565,
      "2KR1": 566,
      "4Q3": 567,
      "2P2P2": 568,
      "3Q1": 569,
      "q2p": 570,
      "R3KB1R": 571,
      "4q3": 572,
      "44": 573,
      "1B6": 574,
      "P5PP": 575,
      "3p1n2": 576,
      "1b3": 577,
      "b1ppp": 578,
      "1P5P": 579,
      "3P2P1": 580,
      "2P1P": 581,
      "3p1p2": 582,
      "2p4p": 583,
      "pP1": 584,
      "pp6": 585,
      "1PP3": 586,
      "1p1p4": 587,
      "3P3": 588,
      "P1P5": 589,
      "1R2": 590,
      "RN3": 591,
      "2n1p": 592,
      "6b1": 593,
      "pp1pp": 594,
      "r1bqk1nr": 595,
      "1p3ppp": 596,
      "3k4": 597,
      "PP1P1": 598,
      "5R": 599,
      "5q2": 600,
      "Q2P": 601,
      "4P1P1": 602,
      "Q1PP": 603,
      "4K": 604,
      "PP2PPPP": 605,
      "N1PP1": 606,
      "bp2": 607,
      "p2p4": 608,
      "3p3p": 609,
      "3K4": 610,
      "1r2": 611,
      "3q1": 612,
      "B1PPP": 613,
      "2p2p2": 614,
      "45": 615,
      "K1P": 616,
      "PP1P": 617,
      "PPPPPPPP": 618,
      "5r": 619,
      "N1PP": 620,
      "P1K": 621,
      "1K6": 622,
      "rn1qkb1r": 623,
      "pp3p": 624,
      "3p3": 625,
      "Q1PPP": 626,
      "4P2P": 627,
      "4N": 628,
      "P4P2": 629,
      "P3P3": 630,
      "p2P": 631,
      "rn1q1rk1": 632,
      "r2qkbnr": 633,
      "b2p": 634,
      "2q1": 635,
      "Bp": 636,
      "1p2p": 637,
      "1P3P2": 638,
      "3P1N2": 639,
      "rn1qkbnr": 640,
      "1p5p": 641,
      "p1p5": 642,
      "P4PP1": 643,
      "p1k": 644,
      "2p1p1": 645,
      "1k6": 646,
      "3pp3": 647,
      "1n1": 648,
      "P2P4": 649,
      "PP4P1": 650,
      "pp2bppp": 651,
      "3k1": 652,
      "P1p": 653,
      "46": 654,
      "QPP1": 655,
      "r2qr1k1": 656,
      "kpp": 657,
      "rnbqk1nr": 658,
      "1P3PP1": 659,
      "P1P2PPP": 660,
      "3RR1K1": 661,
      "QP1": 662,
      "1PP2PPP": 663,
      "2B2": 664,
      "r1b1r": 665,
      "B3P": 666,
      "RN1Q1RK1": 667,
      "PPK": 668,
      "p4p2": 669,
      "6Q1": 670,
      "N5": 671,
      "Q2K1": 672,
      "RN1QKB1R": 673,
      "RNBQK1NR": 674,
      "R2K": 675,
      "P1B": 676,
      "NPPP": 677,
      "2Q5": 678,
      "2q5": 679,
      "3p1b2": 680,
      "rn3": 681,
      "4PN2": 682,
      "1q1": 683,
      "4n": 684,
      "ppk": 685,
      "4PP2": 686,
      "1p3p2": 687,
      "ppq": 688,
      "PP2PP": 689,
      "q7": 690,
      "47": 691,
      "1N1": 692,
      "RN3RK1": 693,
      "2q2": 694,
      "2PP": 695,
      "2b2": 696,
      "p5pp": 697,
      "RN1QK2R": 698,
      "P1B1": 699,
      "3n1": 700,
      "pp1p1ppp": 701,
      "1r3rk1": 702,
      "p2n": 703,
      "Q1P1": 704,
      "BPN2": 705,
      "q1pp": 706,
      "6N1": 707,
      "1R3RK1": 708,
      "1pp3": 709,
      "Np": 710,
      "2Q2": 711,
      "RNB2RK1": 712,
      "k1r": 713,
      "1b6": 714,
      "1PP5": 715,
      "4B": 716,
      "r2q1": 717,
      "p1P": 718,
      "1pp5": 719,
      "2Pp4": 720,
      "1q2": 721,
      "PPP5": 722,
      "rn1qk2r": 723,
      "4q": 724,
      "4Q": 725,
      "1R4K1": 726,
      "2N1P": 727,
      "r1b1kb1r": 728,
      "5R1K": 729,
      "n1pp": 730,
      "p2b": 731,
      "pp1ppppp": 732,
      "2np4": 733,
      "p1b": 734,
      "PP1N": 735,
      "pP2": 736,
      "6q1": 737,
      "ppp1bppp": 738,
      "48": 739,
      "Qp": 740,
      "r6r": 741,
      "2Q1": 742,
      "KPP": 743,
      "p4pp1": 744,
      "p1np1": 745,
      "3p1np1": 746,
      "p1pp": 747,
      "q2k1": 748,
      "bpn2": 749,
      "p1p2ppp": 750,
      "bP": 751,
      "r1p": 752,
      "R1P": 753,
      "PP3P1P": 754,
      "N1P1": 755,
      "PPQ": 756,
      "7Q": 757,
      "pp3p1p": 758,
      "2K1": 759,
      "p1q": 760,
      "R2R2K1": 761,
      "1r4k1": 762,
      "p2pp": 763,
      "4RRK1": 764,
      "BP3": 765,
      "6R": 766,
      "RN2K2R": 767,
      "PP3P2": 768,
      "PPB": 769,
      "RNB1K1NR": 770,
      "q1p1": 771,
      "R1BQR1K1": 772,
      "PK1": 773,
      "n5": 774,
      "3N1": 775,
      "n1p1": 776,
      "PPP3P1": 777,
      "P1B2": 778,
      "PB3": 779,
      "1p3pp1": 780,
      "49": 781,
      "r2k": 782,
      "P1Q": 783,
      "P1p1": 784,
      "RN1QKBNR": 785,
      "1Q6": 786,
      "2KR4": 787,
      "2kr1b1r": 788,
      "n1pp1": 789,
      "5r1k": 790,
      "R2QKBNR": 791,
      "PP5P": 792,
      "2k1": 793,
      "nP": 794,
      "2N1P3": 795,
      "qP": 796,
      "2p1P3": 797,
      "6r": 798,
      "1P1P": 799,
      "pb2": 800,
      "3pN3": 801,
      "PP2BPPP": 802,
      "3pP": 803,
      "1P4PP": 804,
      "bk1": 805,
      "3k": 806,
      "p4p1p": 807,
      "n2p": 808,
      "pp4p1": 809,
      "1pp2ppp": 810,
      "pp5p": 811,
      "2KR1B1R": 812,
      "B1P2": 813,
      "PPP2P2": 814,
      "PPP1BPPP": 815,
      "rn3rk1": 816,
      "rnb1kbnr": 817,
      "N2PP": 818,
      "R6R": 819,
      "5np1": 820,
      "2n1pn2": 821,
      "PP1N1PPP": 822,
      "1q6": 823,
      "2p1pn2": 824,
      "R3K": 825,
      "q1ppp": 826,
      "R1BQK1NR": 827,
      "4K1": 828,
      "PPQ2": 829,
      "p1b1": 830,
      "7q": 831,
      "2NP4": 832,
      "50": 833,
      "P4P1P": 834,
      "2P4": 835,
      "npp": 836,
      "1Q1": 837,
      "qpp1": 838,
      "PPP2P1P": 839,
      "p1n1p": 840,
      "bn2": 841,
      "pb3": 842,
      "2rq1rk1": 843,
      "PP1P1PPP": 844,
      "R4R1K": 845,
      "1K1R3R": 846,
      "4k1": 847,
      "2K4R": 848,
      "B5": 849,
      "2pb1": 850,
      "2p4": 851,
      "r3k": 852,
      "Q1PP1": 853,
      "Q2P1": 854,
      "P2N": 855,
      "npbp": 856,
      "4pp2": 857,
      "P2B": 858,
      "4rrk1": 859,
      "PB2": 860,
      "R2Q1": 861,
      "5N1P": 862,
      "PPPP2PP": 863,
      "b5": 864,
      "1PP2PP1": 865,
      "R1B1R1K1": 866,
      "K1R": 867,
      "r4r2": 868,
      "NB1": 869,
      "N2P": 870,
      "pp2ppbp": 871,
      "r3kbnr": 872,
      "ppp2p1p": 873,
      "1p2P3": 874,
      "1n2": 875,
      "2BP4": 876,
      "P2Q": 877,
      "6n1": 878,
      "Q7": 879,
      "r1b1kbnr": 880,
      "5pk1": 881,
      "51": 882,
      "pp1b": 883,
      "QP2": 884,
      "pp1ppp": 885,
      "rnb1k2r": 886,
      "Np1": 887,
      "Q2PP": 888,
      "r1b1k1nr": 889,
      "PPB2": 890,
      "pp1n1ppp": 891,
      "1Q3": 892,
      "rnb2": 893,
      "2kr4": 894,
      "1q3": 895,
      "P1PP": 896,
      "6PK": 897,
      "3pp": 898,
      "3Pn3": 899,
      "ppp5": 900,
      "2pb": 901,
      "3NP3": 902,
      "R1B1KB1R": 903,
      "Bp1": 904,
      "2k4r": 905,
      "n1p3": 906,
      "q2ppp": 907,
      "r2qk1nr": 908,
      "BK1": 909,
      "r3k1nr": 910,
      "P2P2": 911,
      "5NP1": 912,
      "1PN": 913,
      "2NP1N2": 914,
      "nP3": 915,
      "2P2PPP": 916,
      "4R1": 917,
      "1p2p1p1": 918,
      "pp3p2": 919,
      "pk1": 920,
      "5PK1": 921,
      "r2r2k1": 922,
      "2n3p1": 923,
      "B2P1": 924,
      "qn": 925,
      "rn2k2r": 926,
      "1Q2": 927,
      "P1b1": 928,
      "r1bqr1k1": 929,
      "q5": 930,
      "2np1n2": 931,
      "3P2b1": 932,
      "BPP": 933,
      "B3K1": 934,
      "2N3P1": 935,
      "3K": 936,
      "PP3P": 937,
      "p2p2": 938,
      "52": 939,
      "P1N1P": 940,
      "2kr2": 941,
      "3B1N2": 942,
      "2N2P2": 943,
      "PPP4P": 944,
      "6pk": 945,
      "3rr1k1": 946,
      "1N2": 947,
      "r4r1k": 948,
      "r1bq1": 949,
      "P1PP1": 950,
      "P1Q2": 951,
      "R1B2": 952,
      "3nP3": 953,
      "1P2P": 954,
      "4r1": 955,
      "2RQ1RK1": 956,
      "2KR2": 957,
      "1p4pp": 958,
      "bk": 959,
      "BN1P": 960,
      "2p2ppp": 961,
      "2N4P": 962,
      "B2PP": 963,
      "ppb1": 964,
      "p3p1": 965,
      "qp2": 966,
      "ppp1ppbp": 967,
      "q2p1": 968,
      "KQk": 969,
      "p3p2p": 970,
      "rnb2rk1": 971,
      "R4R2": 972,
      "3p2B1": 973,
      "P1Q1": 974,
      "ppp4p": 975,
      "3n2": 976,
      "Q5": 977,
      "1pn": 978,
      "bp1p": 979,
      "1N6": 980,
      "P1P3PP": 981,
      "ppp3p1": 982,
      "53": 983,
      "1p1b": 984,
      "k3r": 985,
      "2N1PN2": 986,
      "2pP": 987,
      "p2q": 988,
      "4Pp2": 989,
      "2R1R1K1": 990,
      "b2p1": 991,
      "2PB4": 992,
      "p3p1p1": 993,
      "p1q1": 994,
      "PP2N": 995,
      "pppb": 996,
      "R3K1NR": 997,
      "nP1": 998,
      "npp1": 999,
      "Q1P2": 1000,
      "b1p2": 1001,
      "5Q": 1002,
      "3R2": 1003,
      "2pp2": 1004,
      "N1P2": 1005,
      "Kkq": 1006,
      "1pp2pp1": 1007,
      "3r2": 1008,
      "ppp2p2": 1009,
      "bpp": 1010,
      "p1P1": 1011,
      "2NB": 1012,
      "2p1p1p1": 1013,
      "2p2pp1": 1014,
      "pq": 1015,
      "2PB": 1016,
      "P1NP1": 1017,
      "nb1": 1018,
      "2NB4": 1019,
      "PPPQ": 1020,
      "2B3": 1021,
      "2P2PP1": 1022,
      "qk1": 1023,
      "rnb1kb1r": 1024,
      "pB": 1025,
      "NP2": 1026,
      "RNB1KB1R": 1027,
      "p2Q": 1028,
      "Pb": 1029,
      "2PB1": 1030,
      "54": 1031,
      "3K1": 1032,
      "N2P1": 1033,
      "1n6": 1034,
      "r1b1r1k1": 1035,
      "1k1r3r": 1036,
      "P2p1": 1037,
      "np2": 1038,
      "PPP1QPPP": 1039,
      "NPP": 1040,
      "R6K": 1041,
      "2NB1N2": 1042,
      "pp3pbp": 1043,
      "1BP": 1044,
      "RP": 1045,
      "q3r": 1046,
      "5n1p": 1047,
      "b2pp": 1048,
      "1bp": 1049,
      "rnb1k1nr": 1050,
      "n2pp": 1051,
      "p2p2p1": 1052,
      "rn2kb1r": 1053,
      "n1pbp": 1054,
      "rp": 1055,
      "Pq": 1056,
      "nP2": 1057,
      "3PP": 1058,
      "2P1p3": 1059,
      "2PB1N2": 1060,
      "pN": 1061,
      "1PP3PP": 1062,
      "2N1B3": 1063,
      "2P3PP": 1064,
      "K3R": 1065,
      "P4N2": 1066,
      "nbppp": 1067,
      "BK": 1068,
      "R1B1K1NR": 1069,
      "NPP1": 1070,
      "1p3p1p": 1071,
      "4pP2": 1072,
      "R2QK1NR": 1073,
      "Np3": 1074,
      "4N1": 1075,
      "pQ": 1076,
      "RR3": 1077,
      "KQq": 1078,
      "55": 1079,
      "bP1": 1080,
      "p1B1": 1081,
      "2p1p2p": 1082,
      "P1P4P": 1083,
      "kp2": 1084,
      "2r1r1k1": 1085,
      "1P3N2": 1086,
      "RNB1KBNR": 1087,
      "P1N5": 1088,
      "rp1": 1089,
      "1r1q1rk1": 1090,
      "1P3P1P": 1091,
      "P3P1": 1092,
      "k1p1": 1093,
      "p2P1": 1094,
      "3p1P2": 1095,
      "4bppp": 1096,
      "b1n2": 1097,
      "p2ppp": 1098,
      "2r3": 1099,
      "1p1P4": 1100,
      "4n1": 1101,
      "2n4p": 1102,
      "p3pn2": 1103,
      "n1p2": 1104,
      "bp3": 1105,
      "5K": 1106,
      "q2pp": 1107,
      "3P1p2": 1108,
      "7b": 1109,
      "ppq1": 1110,
      "Np2": 1111,
      "1PN1": 1112,
      "2P2N1P": 1113,
      "5N": 1114,
      "RP1": 1115,
      "KP2": 1116,
      "R2P": 1117,
      "2PP2": 1118,
      "p1b2": 1119,
      "1p2pn2": 1120,
      "Pn": 1121,
      "QRK1": 1122,
      "p1n1p3": 1123,
      "PQ": 1124,
      "4P1b1": 1125,
      "2ppP3": 1126,
      "5k": 1127,
      "2R3": 1128,
      "BP1P": 1129,
      "q1pp1": 1130,
      "p1pp1": 1131,
      "P2PP": 1132,
      "5q": 1133,
      "r1bnr": 1134,
      "2N2N1P": 1135,
      "R2Q": 1136,
      "P2PPP": 1137,
      "1p2p2p": 1138,
      "1R1Q1RK1": 1139,
      "56": 1140,
      "2RR2K1": 1141,
      "B1PP1": 1142,
      "NP3": 1143,
      "2p3pp": 1144,
      "R2Q2K1": 1145,
      "b1pp1": 1146,
      "1PP3P1": 1147,
      "PPPB": 1148,
      "P1P3P1": 1149,
      "p1p3pp": 1150,
      "2P1PN2": 1151,
      "2P1B3": 1152,
      "p1p1p": 1153,
      "r6k": 1154,
      "4p1B1": 1155,
      "p3P3": 1156,
      "2n2p2": 1157,
      "3Np3": 1158,
      "1P2p3": 1159,
      "7n": 1160,
      "p2p3p": 1161,
      "K1P1": 1162,
      "R3KBNR": 1163,
      "Q1N2": 1164,
      "pn2": 1165,
      "PPN": 1166,
      "rk": 1167,
      "p1p4p": 1168,
      "PPPQ1PPP": 1169,
      "p2P4": 1170,
      "7B": 1171,
      "3P2p1": 1172,
      "1p1n": 1173,
      "5n": 1174,
      "pppn": 1175,
      "p1n5": 1176,
      "ppb": 1177,
      "4R2K": 1178,
      "3p2P1": 1179,
      "qrk1": 1180,
      "PP2PPBP": 1181,
      "p4n2": 1182,
      "Qkq": 1183,
      "Q1p": 1184,
      "RNBQR1K1": 1185,
      "rn1qk1nr": 1186,
      "4pp": 1187,
      "4Q1": 1188,
      "q1p2": 1189,
      "1k3": 1190,
      "RK": 1191,
      "pppp2pp": 1192,
      "4q1": 1193,
      "PP1Q": 1194,
      "1p1p2p1": 1195,
      "k7": 1196,
      "p1p3p1": 1197,
      "6kp": 1198,
      "R1B3K1": 1199,
      "P1p2": 1200,
      "P3p": 1201,
      "3PN3": 1202,
      "pppq": 1203,
      "57": 1204,
      "ppp1qppp": 1205,
      "5pkp": 1206,
      "1PN2": 1207,
      "p3P": 1208,
      "1K3": 1209,
      "b1P": 1210,
      "k2p": 1211,
      "1P2P1P1": 1212,
      "1pq": 1213,
      "3B2": 1214,
      "1K1R4": 1215,
      "Qp1": 1216,
      "N1p": 1217,
      "B7": 1218,
      "ppn": 1219,
      "ppp2pbp": 1220,
      "2p2p": 1221,
      "r2p": 1222,
      "7N": 1223,
      "B1p": 1224,
      "1q4": 1225,
      "b7": 1226,
      "1n3": 1227,
      "4B1": 1228,
      "1N3": 1229,
      "1b1P4": 1230,
      "n1P": 1231,
      "k5": 1232,
      "3q1rk1": 1233,
      "PP1PPP": 1234,
      "3N2": 1235,
      "QPP": 1236,
      "PPQ1": 1237,
      "K5": 1238,
      "2p2P2": 1239,
      "2BPP3": 1240,
      "PP1PP": 1241,
      "K7": 1242,
      "pbp1": 1243,
      "P1P1P": 1244,
      "2Pp": 1245,
      "4b1": 1246,
      "r2q2k1": 1247,
      "3r3r": 1248,
      "1R2R1K1": 1249,
      "3QP3": 1250,
      "n7": 1251,
      "R1BQ1": 1252,
      "3R3K": 1253,
      "P1P2PP1": 1254,
      "qp1p": 1255,
      "q1P": 1256,
      "R2R": 1257,
      "B1P3": 1258,
      "rn2kbnr": 1259,
      "P2q": 1260,
      "PP1B": 1261,
      "1pp3p1": 1262,
      "Q3R": 1263,
      "2P2P1P": 1264,
      "pp1b1ppp": 1265,
      "2rr2k1": 1266,
      "58": 1267,
      "r1b3k1": 1268,
      "r2r": 1269,
      "1pn1": 1270,
      "PPPB1PPP": 1271,
      "5b": 1272,
      "p1N1": 1273,
      "2PP1N2": 1274,
      "2kr1bnr": 1275,
      "P2P3P": 1276,
      "PP2QPPP": 1277,
      "2b3": 1278,
      "PN": 1279,
      "P6": 1280,
      "P2B1": 1281,
      "q2pp1": 1282,
      "n2p1": 1283,
      "6KP": 1284,
      "1K2": 1285,
      "1p2bppp": 1286,
      "PPQ2PPP": 1287,
      "3R3R": 1288,
      "PP3PBP": 1289,
      "3b1n2": 1290,
      "R1p": 1291,
      "1Q4": 1292,
      "r2q": 1293,
      "4P2p": 1294,
      "1k2": 1295,
      "1p3n2": 1296,
      "5B": 1297,
      "2bp4": 1298,
      "5kp1": 1299,
      "N7": 1300,
      "2PQ": 1301,
      "P1q": 1302,
      "3p3P": 1303,
      "2p2np1": 1304,
      "R1P1": 1305,
      "2kr2nr": 1306,
      "Q3PP": 1307,
      "p1p1p3": 1308,
      "2p2p1p": 1309,
      "1PP2P2": 1310,
      "PP1N1PP1": 1311,
      "5pbp": 1312,
      "1PP4": 1313,
      "K2P": 1314,
      "P1P2P2": 1315,
      "RN2KB1R": 1316,
      "3P3p": 1317,
      "n1p1p": 1318,
      "p6": 1319,
      "4PB2": 1320,
      "pp2p": 1321,
      "1PQ": 1322,
      "4P1p1": 1323,
      "np1p": 1324,
      "pp1q": 1325,
      "ppn2": 1326,
      "4r2k": 1327,
      "5KP1": 1328,
      "P2p4": 1329,
      "1P1p4": 1330,
      "P3P2P": 1331,
      "3P1Q2": 1332,
      "3b2": 1333,
      "p1P2": 1334,
      "1K5R": 1335,
      "p3bppp": 1336,
      "3BP3": 1337,
      "2pp1n2": 1338,
      "PPB1": 1339,
      "4k2r": 1340,
      "pppp1pp1": 1341,
      "1R5": 1342,
      "2P2Q2": 1343,
      "2P1P1P1": 1344,
      "2P2p2": 1345,
      "2P1P2P": 1346,
      "RN1QK1NR": 1347,
      "P1b": 1348,
      "p1Q": 1349,
      "NPBP": 1350,
      "QP1P": 1351,
      "59": 1352,
      "Rp": 1353,
      "3p1n1p": 1354,
      "rr3": 1355,
      "R2p": 1356,
      "r1P": 1357,
      "2pb4": 1358,
      "2p2n1p": 1359,
      "PPPN": 1360,
      "2N2Q2": 1361,
      "qpp": 1362,
      "p1p2pp1": 1363,
      "p1pP": 1364,
      "2KRR3": 1365,
      "rP": 1366,
      "r1p1": 1367,
      "1B1p4": 1368,
      "QK1": 1369,
      "1B2p3": 1370,
      "R1B1KBNR": 1371,
      "2p1b3": 1372,
      "2n1p1p1": 1373,
      "PPPN1PPP": 1374,
      "1r5": 1375,
      "2N1BN2": 1376,
      "1pp3pp": 1377,
      "1PQ2": 1378,
      "R3R3": 1379,
      "1p1pP3": 1380,
      "P3p3": 1381,
      "pn": 1382,
      "kppp": 1383,
      "5PKP": 1384,
      "p1p2p2": 1385,
      "1b3ppp": 1386,
      "P1n1": 1387,
      "pp2bpp1": 1388,
      "ppq2ppp": 1389,
      "1K1R1": 1390,
      "6RK": 1391,
      "r3r3": 1392,
      "2K1R3": 1393,
      "3Q1RK1": 1394,
      "RPP": 1395,
      "2KR2NR": 1396,
      "r1q1": 1397,
      "R3P": 1398,
      "1ppp1": 1399,
      "2pq": 1400,
      "1pq1": 1401,
      "R1R3K1": 1402,
      "5k1p": 1403,
      "4p2P": 1404,
      "r1q2": 1405,
      "P1N2N2": 1406,
      "RN2K1NR": 1407,
      "3P1N1P": 1408,
      "qP1": 1409,
      "2NB1": 1410,
      "pq2": 1411,
      "2q3": 1412,
      "R3K3": 1413,
      "pppb1ppp": 1414,
      "p2b1": 1415,
      "2bp": 1416,
      "p2p1n2": 1417,
      "pkp": 1418,
      "1k1r4": 1419,
      "P2Q1": 1420,
      "6rk": 1421,
      "p2q1": 1422,
      "pq1": 1423,
      "r1r3k1": 1424,
      "Bpp": 1425,
      "1P1N": 1426,
      "1P1P2P1": 1427,
      "PP2BPP1": 1428,
      "4p1P1": 1429,
      "2PPP3": 1430,
      "4b1p1": 1431,
      "3P1P": 1432,
      "ppp1p1": 1433,
      "n2P": 1434,
      "r3k3": 1435,
      "2pPp3": 1436,
      "3p1p": 1437,
      "2b1P3": 1438,
      "60": 1439,
      "3pn3": 1440,
      "1P1B": 1441,
      "3bp3": 1442,
      "1rb": 1443,
      "N2p": 1444,
      "bn1p": 1445,
      "k1pp": 1446,
      "1pp2p2": 1447,
      "3r3k": 1448,
      "2N2NP1": 1449,
      "r2q1r2": 1450,
      "PKP": 1451,
      "1k5r": 1452,
      "p1B": 1453,
      "PP1N2PP": 1454,
      "p2k": 1455,
      "N1PBP": 1456,
      "3Pp": 1457,
      "3pPp2": 1458,
      "1P1P1": 1459,
      "5K1P": 1460,
      "P2N2": 1461,
      "1P1Q": 1462,
      "kr": 1463,
      "2nb": 1464,
      "1q2p3": 1465,
      "4BN2": 1466,
      "2k2": 1467,
      "1PB": 1468,
      "Q1K1": 1469,
      "r1r2": 1470,
      "pp2nppp": 1471,
      "4PP": 1472,
      "4pb2": 1473,
      "2np1np1": 1474,
      "1p1q": 1475,
      "4B2P": 1476,
      "2r1k2r": 1477,
      "Pn2": 1478,
      "1PPP1": 1479,
      "N1B1": 1480,
      "3PB3": 1481,
      "2n2n1p": 1482,
      "1PN5": 1483,
      "3P1NP1": 1484,
      "P3P1P1": 1485,
      "2np2p1": 1486,
      "QK2R": 1487,
      "N1p1": 1488,
      "1P2PN2": 1489,
      "N1P1P": 1490,
      "Npp": 1491,
      "PB3PPP": 1492,
      "2P2B2": 1493,
      "4p1N1": 1494,
      "2P2NP1": 1495,
      "5PPK": 1496,
      "rn2k1nr": 1497,
      "KPPP": 1498,
      "PPP1NPPP": 1499,
      "PP1B1PPP": 1500,
      "rpp": 1501,
      "p1q2": 1502,
      "2NPB": 1503,
      "P3PP": 1504,
      "pp2pp1p": 1505,
      "3B3P": 1506,
      "P1P1P3": 1507,
      "2K3R1": 1508,
      "3B1P2": 1509,
      "Bp3": 1510,
      "b1p3": 1511,
      "4K2R": 1512,
      "p1p2p": 1513,
      "1r2r1k1": 1514,
      "2k1r3": 1515,
      "b1p1p": 1516,
      "61": 1517,
      "R4K2": 1518,
      "2BpP3": 1519,
      "r3p": 1520,
      "3Q2": 1521,
      "2KR2R1": 1522,
      "1pn2": 1523,
      "ppp1nppp": 1524,
      "P1n": 1525,
      "p1N": 1526,
      "pb3ppp": 1527,
      "2KR1BNR": 1528,
      "2pp2p1": 1529,
      "n1bp": 1530,
      "4BPPP": 1531,
      "2nb4": 1532,
      "1pb": 1533,
      "2k3r1": 1534,
      "1P2P2P": 1535,
      "3q2": 1536,
      "1P1P3P": 1537,
      "1PP4P": 1538,
      "QN": 1539,
      "K1P2": 1540,
      "P1P2P1P": 1541,
      "R2Q1R1K": 1542,
      "p3pp": 1543,
      "2PQ4": 1544,
      "R3p": 1545,
      "4pn1p": 1546,
      "3np3": 1547,
      "4P1B1": 1548,
      "p1p2p1p": 1549,
      "R1Q1": 1550,
      "Qpp": 1551,
      "3p1q2": 1552,
      "5Q1P": 1553,
      "q1k1": 1554,
      "p1pb": 1555,
      "1p1p3p": 1556,
      "2p3P1": 1557,
      "P3PN2": 1558,
      "1pP": 1559,
      "PBP1": 1560,
      "r4k2": 1561,
      "P1Pp": 1562,
      "p1ppp": 1563,
      "3P2Q1": 1564,
      "pp1nbppp": 1565,
      "2n2np1": 1566,
      "RN2R1K1": 1567,
      "3R1R1K": 1568,
      "pp2p3": 1569,
      "pP4": 1570,
      "K1PP": 1571,
      "r2q1r1k": 1572,
      "r2P": 1573,
      "1b2P3": 1574,
      "4B1P1": 1575,
      "4bpp1": 1576,
      "3BPN2": 1577,
      "NN1": 1578,
      "P2b": 1579,
      "1pP5": 1580,
      "5ppk": 1581,
      "p4pbp": 1582,
      "2P1N3": 1583,
      "br1": 1584,
      "2PP3P": 1585,
      "pp1n1pp1": 1586,
      "4BP2": 1587,
      "Bp2": 1588,
      "PB4": 1589,
      "Bb1": 1590,
      "k1p2": 1591,
      "P2n": 1592,
      "PPP1B1PP": 1593,
      "PPPP1PP1": 1594,
      "ppppppbp": 1595,
      "R1Q2": 1596,
      "P3BPPP": 1597,
      "1p3P2": 1598,
      "5pb1": 1599,
      "n1P1": 1600,
      "r1b5": 1601,
      "3p2pp": 1602,
      "2pb1n2": 1603,
      "2kr2r1": 1604,
      "Rp1": 1605,
      "62": 1606,
      "1P1B4": 1607,
      "PP2B1PP": 1608,
      "5P1K": 1609,
      "pB1": 1610,
      "3pb3": 1611,
      "3PP1": 1612,
      "BPP2": 1613,
      "5p1k": 1614,
      "P3B": 1615,
      "p1n1pn2": 1616,
      "pppppp": 1617,
      "rnbq1": 1618,
      "Pb1": 1619,
      "nk1": 1620,
      "r3P": 1621,
      "ppp1pp1p": 1622,
      "n1b1": 1623,
      "1B1P4": 1624,
      "bP2": 1625,
      "1PB2": 1626,
      "3rk2r": 1627,
      "3pN": 1628,
      "2BP": 1629,
      "2PpP3": 1630,
      "1pp4p": 1631,
      "PQ1": 1632,
      "pppn1ppp": 1633,
      "1ppb": 1634,
      "p2pp1": 1635,
      "3r1r2": 1636,
      "P2b1": 1637,
      "nB2": 1638,
      "1pp1p3": 1639,
      "p2p1np1": 1640,
      "rP1": 1641,
      "2p1n3": 1642,
      "6bp": 1643,
      "p2B": 1644,
      "PP1Q1PPP": 1645,
      "p1pp1ppp": 1646,
      "2P3p1": 1647,
      "pppq1ppp": 1648,
      "PPP1BPP1": 1649,
      "PPB2PPP": 1650,
      "2PBPN2": 1651,
      "3b1p2": 1652,
      "3p2p": 1653,
      "4kp2": 1654,
      "PN2": 1655,
      "1ppp": 1656,
      "QP3": 1657,
      "ppp1bpp1": 1658,
      "P2B4": 1659,
      "p2p1p2": 1660,
      "p2p1p": 1661,
      "3bpn2": 1662,
      "4p2Q": 1663,
      "b2rk1": 1664,
      "3qp3": 1665,
      "2B1p3": 1666,
      "pp2p1": 1667,
      "PP2NPPP": 1668,
      "pp2b1pp": 1669,
      "P5K1": 1670,
      "4b2p": 1671,
      "RN1QR1K1": 1672,
      "2p4P": 1673,
      "3RK2R": 1674,
      "3P3B": 1675,
      "r1q2rk1": 1676,
      "2pbp": 1677,
      "2pp1np1": 1678,
      "p1n2n2": 1679,
      "Q1P1P": 1680,
      "3RR": 1681,
      "4k1p1": 1682,
      "6pP": 1683,
      "2np1n1p": 1684,
      "1BN2": 1685,
      "ppb2": 1686,
      "3p1pp1": 1687,
      "bP3": 1688,
      "pN1": 1689,
      "2Q3": 1690,
      "2PBP": 1691,
      "2n1p2p": 1692,
      "R1BR2K1": 1693,
      "NP1P": 1694,
      "KR": 1695,
      "P2P2P1": 1696,
      "p2B1": 1697,
      "1Pp5": 1698,
      "p2pP3": 1699,
      "2pp3p": 1700,
      "1pn1p3": 1701,
      "4P1n1": 1702,
      "2nP4": 1703,
      "q3pp": 1704,
      "1BP5": 1705,
      "2np3p": 1706,
      "ppp1b1pp": 1707,
      "2pn": 1708,
      "r1b4r": 1709,
      "K3P": 1710,
      "Q3K": 1711,
      "P4N1P": 1712,
      "PP1PPPPP": 1713,
      "1P1P1P2": 1714,
      "NK1": 1715,
      "PPP1Q1PP": 1716,
      "1B3PPP": 1717,
      "1pn5": 1718,
      "5B1P": 1719,
      "pbpp1ppp": 1720,
      "63": 1721,
      "3p1p1p": 1722,
      "2krr3": 1723,
      "4pp1p": 1724,
      "3P2PP": 1725,
      "2npb": 1726,
      "p5k1": 1727,
      "p1pn": 1728,
      "PPP2PBP": 1729,
      "P1R": 1730,
      "k2pp": 1731,
      "Pn1": 1732,
      "P2N1": 1733,
      "2nb1n2": 1734,
      "4p1b1": 1735,
      "Q2p": 1736,
      "P2N1PPP": 1737,
      "RNB1R1K1": 1738,
      "5PBP": 1739,
      "q1p1p": 1740,
      "R1B2R1K": 1741,
      "p3b": 1742,
      "p2r": 1743,
      "Q3P": 1744,
      "Pb2": 1745,
      "RNK1": 1746,
      "qpn2": 1747,
      "3Bp3": 1748,
      "2p2q2": 1749,
      "rnk1": 1750,
      "3R1R2": 1751,
      "3P1b2": 1752,
      "2Bp4": 1753,
      "2R4K": 1754,
      "P1P2P": 1755,
      "r5r1": 1756,
      "4RK2": 1757,
      "r4k1r": 1758,
      "1PQ1": 1759,
      "3p1ppp": 1760,
      "p2p1ppp": 1761,
      "P1PP1PPP": 1762,
      "PPPPPP": 1763,
      "pppppp1p": 1764,
      "pP6": 1765,
      "4KP2": 1766,
      "1p4P1": 1767,
      "pbpp": 1768,
      "6Pp": 1769,
      "pp2qppp": 1770,
      "1p1p1p2": 1771,
      "PPPQ1PP1": 1772,
      "Pp6": 1773,
      "PN1": 1774,
      "4K1P1": 1775,
      "P2R": 1776,
      "2NP1N1P": 1777,
      "R2P1": 1778,
      "q2P": 1779,
      "2p2b2": 1780,
      "k3p": 1781,
      "PP2P": 1782,
      "K1R1": 1783,
      "2NP3P": 1784,
      "1R1R2K1": 1785,
      "pppp1p1p": 1786,
      "2N1BP2": 1787,
      "pn1": 1788,
      "p2N": 1789,
      "kp1p": 1790,
      "PPPQ2PP": 1791,
      "K2P1": 1792,
      "kpp1": 1793,
      "pp1pppbp": 1794,
      "3P1P1P": 1795,
      "1bp1": 1796,
      "pbp2ppp": 1797,
      "p1p1p1": 1798,
      "P2PP1": 1799,
      "q3k": 1800,
      "4Pn2": 1801,
      "3b3p": 1802,
      "2n1b3": 1803,
      "bPP": 1804,
      "1P3p2": 1805,
      "2P3P": 1806,
      "4ppbp": 1807,
      "P1q1": 1808,
      "1B3N2": 1809,
      "2P4p": 1810,
      "nN": 1811,
      "P1B5": 1812,
      "3N1P2": 1813,
      "3pB3": 1814,
      "r1b2r2": 1815,
      "3R1K2": 1816,
      "n1pn2": 1817,
      "2NBPN2": 1818,
      "r3k1r1": 1819,
      "2pP1": 1820,
      "B3PP": 1821,
      "3r1r1k": 1822,
      "4p1pp": 1823,
      "BQ2": 1824,
      "B1p1": 1825,
      "3pbp": 1826,
      "1pN": 1827,
      "bB1": 1828,
      "3N1PPP": 1829,
      "qpbp": 1830,
      "2P1PP2": 1831,
      "R1p1": 1832,
      "1B5P": 1833,
      "2PP1B2": 1834,
      "r1r": 1835,
      "P3B3": 1836,
      "2p1N3": 1837,
      "1p1b4": 1838,
      "3pPb2": 1839,
      "2RQR1K1": 1840,
      "1b1n": 1841,
      "3p3b": 1842,
      "PPP1PPBP": 1843,
      "2nbpn2": 1844,
      "k1ppp": 1845,
      "2p1pn1p": 1846,
      "64": 1847,
      "qPP": 1848,
      "4bp2": 1849,
      "1PPP": 1850,
      "2p1pp2": 1851,
      "QN2": 1852,
      "1p5P": 1853,
      "kb": 1854,
      "2K2R2": 1855,
      "B3P1": 1856,
      "R2Q1R2": 1857,
      "p1r": 1858,
      "2pN4": 1859,
      "p4P2": 1860,
      "3p1B2": 1861,
      "pQ1": 1862,
      "3n1ppp": 1863,
      "NBP": 1864,
      "PPQ2PP1": 1865,
      "3pp1": 1866,
      "2P3Q1": 1867,
      "R3QRK1": 1868,
      "R5R1": 1869,
      "p1P5": 1870,
      "3bP3": 1871,
      "2P3B1": 1872,
      "1PP1P3": 1873,
      "P1N1P3": 1874,
      "P2P1P2": 1875,
      "R1P2": 1876,
      "PBPP1PPP": 1877,
      "1p1P": 1878,
      "5PB1": 1879,
      "r1b2r1k": 1880,
      "r1bk1": 1881,
      "1qn1p3": 1882,
      "2p3B1": 1883,
      "4PN1P": 1884,
      "4RR1K": 1885,
      "2p3p": 1886,
      "2r4k": 1887,
      "PQ2": 1888,
      "p2n1": 1889,
      "2r4r": 1890,
      "R3K1R1": 1891,
      "npb1": 1892,
      "5q1p": 1893,
      "3PQ3": 1894,
      "2pq4": 1895,
      "Pq1": 1896,
      "1P2BPPP": 1897,
      "r1br2k1": 1898,
      "3p2q1": 1899,
      "1p1p1ppp": 1900,
      "k2p1": 1901,
      "2k2r2": 1902,
      "q1n2": 1903,
      "R4K1": 1904,
      "B1P1P": 1905,
      "p2n1ppp": 1906,
      "Pr": 1907,
      "KPP1": 1908,
      "pp2pp": 1909,
      "6BP": 1910,
      "RNB2": 1911,
      "4rk2": 1912,
      "5b1p": 1913,
      "p6P": 1914,
      "RNBQ1": 1915,
      "3Pb3": 1916,
      "pbpp1": 1917,
      "3p2N1": 1918,
      "p5P1": 1919,
      "pp4bp": 1920,
      "5Pp1": 1921,
      "P4K2": 1922,
      "1b3pp1": 1923,
      "kr2": 1924,
      "3P1PP1": 1925,
      "K2PP": 1926,
      "2PBP3": 1927,
      "r4b1r": 1928,
      "P1p5": 1929,
      "kb1": 1930,
      "p4n1p": 1931,
      "PBP2PPP": 1932,
      "PP2Q1PP": 1933,
      "P3R": 1934,
      "r2qk": 1935,
      "pq3": 1936,
      "p1k1": 1937,
      "3r1k2": 1938,
      "2B1P1b1": 1939,
      "NQ": 1940,
      "RN4K1": 1941,
      "2P1Q3": 1942,
      "r2q3r": 1943,
      "1RB": 1944,
      "nn1": 1945,
      "P1PB": 1946,
      "R2R1": 1947,
      "2B2P2": 1948,
      "2NP1": 1949,
      "2Pn": 1950,
      "R1Q2RK1": 1951,
      "5pP1": 1952,
      "BP4": 1953,
      "2Pn4": 1954,
      "1b2bppp": 1955,
      "KP1P": 1956,
      "2p3b1": 1957,
      "k1r1": 1958,
      "rn1q1": 1959,
      "p3ppbp": 1960,
      "2q2ppp": 1961,
      "2r2r2": 1962,
      "4p1n1": 1963,
      "2PP1P2": 1964,
      "qnrk1": 1965,
      "2BnP3": 1966,
      "p4k2": 1967,
      "R1R": 1968,
      "R4K1R": 1969,
      "2pN": 1970,
      "1r1r2k1": 1971,
      "P2P1P": 1972,
      "kP": 1973,
      "3B2P1": 1974,
      "5bp1": 1975,
      "4bn2": 1976,
      "p2b4": 1977,
      "4pq2": 1978,
      "1p3pbp": 1979,
      "pp1n2pp": 1980,
      "qp3": 1981,
      "P4PBP": 1982,
      "3RR3": 1983,
      "ppq2": 1984,
      "1Pn": 1985,
      "3P2P": 1986,
      "P3Q": 1987,
      "PPPPBPPP": 1988,
      "P1N4P": 1989,
      "3pPn2": 1990,
      "4BPP1": 1991,
      "2pbpn2": 1992,
      "4P1Q1": 1993,
      "2P1BN2": 1994,
      "Q2P4": 1995,
      "2PN4": 1996,
      "2R1K2R": 1997,
      "pN2": 1998,
      "2n2q2": 1999,
      "1p1n4": 2000,
      "PQ3": 2001,
      "bpn1p": 2002,
      "2PP1N1P": 2003,
      "3Q1N2": 2004,
      "r2p1": 2005,
      "N1P3": 2006,
      "3rr": 2007,
      "b3p": 2008,
      "p2n2": 2009,
      "1P2B3": 2010,
      "2P1B": 2011,
      "Kp": 2012,
      "P1B1P3": 2013,
      "1BP1": 2014,
      "65": 2015,
      "1pk": 2016,
      "1b1p4": 2017,
      "p2p1n1p": 2018,
      "1K1R1B1R": 2019,
      "K1PPP": 2020,
      "Q1N": 2021,
      "b1P1": 2022,
      "pR": 2023,
      "nrk1": 2024,
      "3P2B1": 2025,
      "3P2N1": 2026,
      "1P4p1": 2027,
      "r1bq1r2": 2028,
      "ppp1q1pp": 2029,
      "P1P2N2": 2030,
      "PP2P1": 2031,
      "5BP1": 2032,
      "ppppbppp": 2033,
      "2KR1R2": 2034,
      "1P3NP1": 2035,
      "r4k1": 2036,
      "2P1n3": 2037,
      "RN2KBNR": 2038,
      "2N1P1P1": 2039,
      "1R5K": 2040,
      "PP2P3": 2041,
      "Pq3": 2042,
      "rnbqr1k1": 2043,
      "pN3": 2044,
      "2Q1P3": 2045,
      "2K2": 2046,
      "p1Q1": 2047,
      "3BP": 2048,
      "P3N": 2049,
      "ppppqppp": 2050,
      "Pr3": 2051,
      "1P3K2": 2052,
      "5p1P": 2053,
      "P4p2": 2054,
      "1BN": 2055,
      "2pP1P2": 2056,
      "NBPPP": 2057,
      "Q1K": 2058,
      "4k2p": 2059,
      "PPN2": 2060,
      "1p2N3": 2061,
      "2p1b": 2062,
      "4p1q1": 2063,
      "1bq1": 2064,
      "1B3P2": 2065,
      "r3qrk1": 2066,
      "1PK": 2067,
      "2Q2PPP": 2068,
      "QPN2": 2069,
      "Q1p1": 2070,
      "p1np4": 2071,
      "P1Q2PPP": 2072,
      "p2R": 2073,
      "1np1": 2074,
      "p1pB": 2075,
      "PPP1N1PP": 2076,
      "3Q3P": 2077,
      "np3": 2078,
      "r2k3r": 2079,
      "4PQ2": 2080,
      "R1B5": 2081,
      "p3b3": 2082,
      "3PpP2": 2083,
      "r1P1": 2084,
      "Nn": 2085,
      "1P4K1": 2086,
      "1KP5": 2087,
      "n1pb1": 2088,
      "3Q1P2": 2089,
      "pPp2": 2090,
      "2NP2P1": 2091,
      "p3pp2": 2092,
      "4pnp1": 2093,
      "PP2N1PP": 2094,
      "NQ1": 2095,
      "3P2n1": 2096,
      "P2P1N2": 2097,
      "1r2k2r": 2098,
      "1PP2P1P": 2099,
      "1n1P4": 2100,
      "1P3N1P": 2101,
      "pR3": 2102,
      "pp1q1ppp": 2103,
      "nbp": 2104,
      "BR1": 2105,
      "p2r1": 2106,
      "2NQ4": 2107,
      "P6p": 2108,
      "P5p1": 2109,
      "r2r4": 2110,
      "4P1N1": 2111,
      "2rqr1k1": 2112,
      "q2p4": 2113,
      "3pq3": 2114,
      "pp1p4": 2115,
      "1kp5": 2116,
      "3p1p1": 2117,
      "B2p": 2118,
      "1b5p": 2119,
      "q3p": 2120,
      "5P1p": 2121,
      "1p2bpp1": 2122,
      "pbpn": 2123,
      "pB2": 2124,
      "r1bq": 2125,
      "1K2R3": 2126,
      "N1BP": 2127,
      "1BN5": 2128,
      "2Np4": 2129,
      "RR4K1": 2130,
      "R3R2K": 2131,
      "3P3N": 2132,
      "2b2rk1": 2133,
      "Qp2": 2134,
      "1PPB": 2135,
      "3b2p1": 2136,
      "5kpp": 2137,
      "3Q2P1": 2138,
      "1Pb": 2139,
      "R1BQ2K1": 2140,
      "nPP": 2141,
      "2PP2P1": 2142,
      "ppB": 2143,
      "q1k": 2144,
      "1p1Pp3": 2145,
      "2Pp1": 2146,
      "P5PK": 2147,
      "R1PP": 2148,
      "5bk1": 2149,
      "PP2QPP1": 2150,
      "PPP1QPP1": 2151,
      "1P5p": 2152,
      "2K3RR": 2153,
      "3pb": 2154,
      "5KPP": 2155,
      "p3n": 2156,
      "2n1P3": 2157,
      "r1bq2k1": 2158,
      "1rb2rk1": 2159,
      "3q2p1": 2160,
      "1ppp1ppp": 2161,
      "1q2p": 2162,
      "3pp1p1": 2163,
      "KR2": 2164,
      "P4PK1": 2165,
      "1PPQ": 2166,
      "rn1qr1k1": 2167,
      "NRK1": 2168,
      "2B3P1": 2169,
      "P2R1": 2170,
      "pp3pb1": 2171,
      "1p3np1": 2172,
      "R2R4": 2173,
      "2q1p3": 2174,
      "1p4k1": 2175,
      "qk1r1": 2176,
      "1b3p2": 2177,
      "66": 2178,
      "2pn4": 2179,
      "1k1r1b1r": 2180,
      "3p2n1": 2181,
      "1pP1": 2182,
      "3rr3": 2183,
      "pb1n": 2184,
      "p4pk1": 2185,
      "3n1p2": 2186,
      "p1np": 2187,
      "PPB2PP1": 2188,
      "Bb": 2189,
      "p3pn1p": 2190,
      "n1r": 2191,
      "2pp1p2": 2192,
      "1P1N4": 2193,
      "4K2P": 2194,
      "4rr1k": 2195,
      "ppp1p1pp": 2196,
      "2K1R2R": 2197,
      "1p1pp3": 2198,
      "2bP4": 2199,
      "p3r": 2200,
      "r6P": 2201,
      "PBPP": 2202,
      "1r5r": 2203,
      "1pp2p1p": 2204,
      "PP2PP1P": 2205,
      "p1np1n2": 2206,
      "1P3B2": 2207,
      "qP2": 2208,
      "QKB1R": 2209,
      "1PN1P": 2210,
      "1k1r2": 2211,
      "P3K3": 2212,
      "4P1PP": 2213,
      "1p2n3": 2214,
      "pPp": 2215,
      "1N1p4": 2216,
      "4rr2": 2217,
      "2kr1r2": 2218,
      "1p3k2": 2219,
      "1p2pp2": 2220,
      "R6p": 2221,
      "P1K1": 2222,
      "1p1p1np1": 2223,
      "N3P": 2224,
      "3qP3": 2225,
      "3ppn2": 2226,
      "p3k3": 2227,
      "4N2": 2228,
      "1R2K2R": 2229,
      "p1P3": 2230,
      "p1b5": 2231,
      "1P1Pp3": 2232,
      "3N1PP1": 2233,
      "2B1n3": 2234,
      "ppq2pp1": 2235,
      "Kk": 2236,
      "PP1PPPBP": 2237,
      "1P1Q4": 2238,
      "1p1p1n2": 2239,
      "PPPPQPPP": 2240,
      "n1k1": 2241,
      "RP2": 2242,
      "1p2ppbp": 2243,
      "2R4R": 2244,
      "p2pp3": 2245,
      "bpp2": 2246,
      "r5P1": 2247,
      "2R2R1K": 2248,
      "2P3b1": 2249,
      "4pN2": 2250,
      "4Np2": 2251,
      "pQ3": 2252,
      "4pk2": 2253,
      "4Pb2": 2254,
      "P1r": 2255,
      "3p2b1": 2256,
      "B3P3": 2257,
      "P1N1PN2": 2258,
      "P1R2": 2259,
      "2p1q3": 2260,
      "1PB5": 2261,
      "R1BQ1R1K": 2262,
      "2r2r1k": 2263,
      "3p3Q": 2264,
      "1R3R1K": 2265,
      "N1R": 2266,
      "1PPP1PPP": 2267,
      "1QP5": 2268,
      "p1n1p2p": 2269,
      "PP4K1": 2270,
      "2PB3P": 2271,
      "QR": 2272,
      "3pP2p": 2273,
      "q1b1": 2274,
      "1K4R1": 2275,
      "4b1pp": 2276,
      "1P1P1N2": 2277,
      "3P1n2": 2278,
      "PPPP1P1P": 2279,
      "4nP2": 2280,
      "nB": 2281,
      "1P3Q2": 2282,
      "5b1r": 2283,
      "1pb1": 2284,
      "rn2r1k1": 2285,
      "3PPP2": 2286,
      "2PB1N1P": 2287,
      "p1pbp": 2288,
      "3b1ppp": 2289,
      "4Q2P": 2290,
      "pp2p2p": 2291,
      "2np1": 2292,
      "PPb": 2293,
      "1P1B1": 2294,
      "2NBBN2": 2295,
      "p1n4p": 2296,
      "5R1P": 2297,
      "P2K": 2298,
      "Pn3": 2299,
      "P2Q4": 2300,
      "p1R": 2301,
      "q1bp": 2302,
      "PPPQ4": 2303,
      "4Q1P1": 2304,
      "p1r1": 2305,
      "Bn": 2306,
      "4N1P1": 2307,
      "p1n1p1p1": 2308,
      "PP1P4": 2309,
      "1Bp5": 2310,
      "P1PP4": 2311,
      "R2p1": 2312,
      "q1P1": 2313,
      "ppp1n1pp": 2314,
      "2p3q1": 2315,
      "1Q2P3": 2316,
      "3p3n": 2317,
      "3k1p2": 2318,
      "P1P4": 2319,
      "PBPP1": 2320,
      "3Q2K1": 2321,
      "p1q2ppp": 2322,
      "BPP3": 2323,
      "1p1n1ppp": 2324,
      "R2K3R": 2325,
      "1P1N1PPP": 2326,
      "1p2b3": 2327,
      "BN1": 2328,
      "R5p1": 2329,
      "ppp2kpp": 2330,
      "pp4k1": 2331,
      "4p2b": 2332,
      "2PB2": 2333,
      "Rp2": 2334,
      "1PB1": 2335,
      "ppp3bp": 2336,
      "1p1b1": 2337,
      "rr4k1": 2338,
      "p1p1bppp": 2339,
      "2b3p1": 2340,
      "5QP1": 2341,
      "1R5R": 2342,
      "1r5k": 2343,
      "5qp1": 2344,
      "p5kp": 2345,
      "2NBP3": 2346,
      "P1R1": 2347,
      "2P2Q1P": 2348,
      "1PN1P3": 2349,
      "4q1p1": 2350,
      "67": 2351,
      "2q2pp1": 2352,
      "4RR2": 2353,
      "p4np1": 2354,
      "b2P": 2355,
      "pb1p": 2356,
      "3P3Q": 2357,
      "2PP3": 2358,
      "P2r": 2359,
      "1bp5": 2360,
      "4NP2": 2361,
      "r1p2": 2362,
      "3q1p2": 2363,
      "5r1p": 2364,
      "p2N1": 2365,
      "k2nr": 2366,
      "2PK4": 2367,
      "2R2R2": 2368,
      "4n1p1": 2369,
      "p5b1": 2370,
      "2Q2PP1": 2371,
      "2r1r": 2372,
      "1Pp": 2373,
      "p2ppn2": 2374,
      "2k1r2r": 2375,
      "nB1": 2376,
      "p1bp": 2377,
      "p5bp": 2378,
      "4PP1P": 2379,
      "nN1": 2380,
      "b1k": 2381,
      "npB": 2382,
      "2pPP3": 2383,
      "P1NB": 2384,
      "P5B1": 2385,
      "2N3": 2386,
      "q2pbp": 2387,
      "3pP1P1": 2388,
      "2P1K3": 2389,
      "p3Q": 2390,
      "1b3p1p": 2391,
      "p1pp4": 2392,
      "P2n1": 2393,
      "2bpP3": 2394,
      "p1p1p2p": 2395,
      "1q4p1": 2396,
      "4p2n": 2397,
      "p1r2": 2398,
      "Qq": 2399,
      "4P2B": 2400,
      "2nbp3": 2401,
      "1pb5": 2402,
      "3q2k1": 2403,
      "1R1QR1K1": 2404,
      "R2PP": 2405,
      "1B2P3": 2406,
      "P1BP": 2407,
      "2p2N2": 2408,
      "p1n3p1": 2409,
      "r1bq1r1k": 2410,
      "3nr": 2411,
      "PR": 2412,
      "p1p2n2": 2413,
      "3q3p": 2414,
      "P2P1PPP": 2415,
      "P2P1N1P": 2416,
      "2B4P": 2417,
      "qp1ppp": 2418,
      "R1B4R": 2419,
      "4n2": 2420,
      "1r3r2": 2421,
      "1p1b1ppp": 2422,
      "ppQ": 2423,
      "PP1N2": 2424,
      "1B3PP1": 2425,
      "3B1N1P": 2426,
      "r2P1": 2427,
      "p5pk": 2428,
      "nQ": 2429,
      "pp1nppbp": 2430,
      "2P3K1": 2431,
      "r2q4": 2432,
      "2pbp3": 2433,
      "3Pp1p1": 2434,
      "3nN3": 2435,
      "4pk": 2436,
      "Pp1p": 2437,
      "2R1R": 2438,
      "PPQ3PP": 2439,
      "2PQ1": 2440,
      "p4pkp": 2441,
      "1K1RR3": 2442,
      "n3p3": 2443,
      "2N2B2": 2444,
      "1P2N3": 2445,
      "rq": 2446,
      "PP1Q1PP1": 2447,
      "bn1": 2448,
      "2P1B2P": 2449,
      "2PPp3": 2450,
      "p3pp1p": 2451,
      "nq1": 2452,
      "1bq": 2453,
      "2p1bppp": 2454,
      "bB": 2455,
      "6QP": 2456,
      "2rqk2r": 2457,
      "kp3": 2458,
      "1rbq1rk1": 2459,
      "Pp4": 2460,
      "p3q": 2461,
      "1P1K4": 2462,
      "1pp1bppp": 2463,
      "r1k2": 2464,
      "1PK5": 2465,
      "3pP1p1": 2466,
      "q1n": 2467,
      "1p3b2": 2468,
      "nq": 2469,
      "2P2K2": 2470,
      "2P3N1": 2471,
      "ppk1": 2472,
      "RB": 2473,
      "P4B2": 2474,
      "3K1P2": 2475,
      "p2Pp3": 2476,
      "b1k1": 2477,
      "1ppq": 2478,
      "N1b": 2479,
      "2p3N1": 2480,
      "2N1B": 2481,
      "P1N2N1P": 2482,
      "P1N3": 2483,
      "P1r2": 2484,
      "2NQ": 2485,
      "2PN": 2486,
      "1K3R2": 2487,
      "5BK1": 2488,
      "3pP2P": 2489,
      "1k2r3": 2490,
      "1p1pp": 2491,
      "P1K5": 2492,
      "3P3q": 2493,
